[
{"title": "Victoria, David Beckham to mark 25 years of togetherness with vow renewal ", "headline": "Victoria Beckham and David Beckham tied the know on July 4th, 1999, in lavish wedding ceremony ", "time": "\nWednesday, January 03, 2024 ", "author": "Mason Hughes", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525564_4573948_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525564-victoria-david-beckham-to-mark-25-years-of-togetherness-with-vow-renewal", "description": ["Victoria Beckham and David Beckham are reportedly set to exchange their vows once again to make their milestone wedding anniversary. ", "The British power couple, who tied the knot in 1999, will celebrate their 25th marriage anniversary on July 11 with lavish celebrations. ", "According to ", ", Victoria and David, who are parents to four kids, “both feel that 25 years of marriage is something to feel proud of, especially in this industry, and they want to mark it in style.” ", "“So, they’ve talked about renewing their vows,” a tipster close the situation revealed. ", "This would be the second time the singer-turned-fashion-designer and the football icon will renew vows as they previously did it in 2006 following David’s alleged affair’s rumours. ", "The source shared how the couple loves their wedding day but dreads their “matching purple outfits and thrones,” adding, “Victoria has joked that they need to rectify that.”", " ", "“Their first vow renewal was a very intimate ceremony, but this time it would be much bigger. They like the idea of a beach renewal,” they added.", "The insider continued: “After everything that happened last year, Vic really feels like 2024 could be their biggest year yet.", "“They’ve won so many more fans since their Netflix documentary aired, and whereas a few years ago it was openly mocked, her marriage and family are now seen as something to look up to. ", "“Victoria has never felt this content, both in her personal and professional life, and she can’t wait to celebrate it all.”"]},
{"title": "Pak vs Aus: Pakistan opt to bat in Sydney test - David Warner's last game", "headline": "Pakistan play its third and last Test as Australia already secured the series with a tense 79-run victory in Melbourne", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525522_1290223_updates.jpg", "category": "Sports", "URL": "https://www.geo.tv/latest/525522-pak-vs-aus-pakistan-opt-to-bat-in-sydney-test-david-warners-last-game", "description": ["Pakistan's skipper Shan Masood elected to bat first in the third Test against Australia at Sydney Cricket Ground (SCG) as David Warner prepares for his final Test match. ", "The 37-year-old opener, Warner, with an impressive record of 8,695 runs at an average of 44.58, aims to conclude his Test career on a high note, bidding adieu at his home ground.", "Masood, expressing hope for a strong first innings, anticipates a promising start under the sunny skies. Australia's skipper, Pat Cummins, also eying a bat-first decision, expects a supportive crowd for Warner at SCG, a venue where the retiring batsman has shined in the past.", "The match marks the 112th Test at SCG and coincidentally, Warner's 112th and his final Test appearance. ", "Pakistan made strategic changes, granting a Test debut to Saim Ayub in place of Imam-Ul-Haq, while resting Shaheen Shah Afridi for off-spinner Sajid Khan, expecting Ayub to set a robust tone for Pakistan's batting lineup.", "Australia secured the series with a tense 79-run victory in Melbourne. The Sydney Test, notorious for rain interruptions, holds a medium chance of showers, while spinners are historically impactful, claiming 54 wickets at an average of 44.02 in the last five matches at SCG.", "The cricket fraternity anticipates an emotional farewell for Warner, looking forward to witnessing his last stand in Test cricket. As the action unfolds at SCG, all eyes are on Warner's final innings and Pakistan's quest for a competitive start to the third Test match.", "David Warner, Usman Khawaja, Marnus Labuschagne, Steve Smith, Travis Head, Mitchell Marsh, Alex Carey, Pat Cummins (capt), Mitchell Starc, Nathan Lyon, Josh Hazlewood", " Saim Ayub, Abdullah Shafique, Shan Masood (capt), Babar Azam, Saud Shakeel, Mohammad Rizwan, Agha Salman, Sajid Khan, Hasan Ali, Mir Hamza, Aamer Jamal", " Richard Illingworth (ENG), Joel Wilson (WIS)", "Michael Gough (ENG)", "Javagal Srinath (IND)"]},
{"title": "‘Slow Horses' lives up to see season five on Apple TV+", "headline": "Apple TV+ nods 'Slow Horses' to go ahead with season five as the comic spy drama success continues", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525519_6092841_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525519-slow-horses-lives-up-to-see-season-five-on-apple-tv", "description": ["Amid the massive success of the comedy espionage drama ", " Apple TV+ has decided to green-light season five of Gary Oldman’s odd MI5 team.", "Based on Mick Herron's novel, the series cast will return as the Oscar winner who played a quick-tempered spy Jackson Lamb has bagged a Golden Globe nomination for his performance, according to ", ". ", "Besides Gary, the series cast includes, Kristin Scott Thomas, Jonathan Pryce, Jack Lowden, Saskia Reeves, Rosalind Eleazar, Chung, Samuel West, Sophie Okonedo, Aimee-Ffion Edwards and Kadiff Kirwan.", "For season 5, the logline reads, “Everyone is suspicious when resident tech nerd Roddy Ho has a glamorous new girlfriend, but when a series of increasingly bizarre events occur across the city, it falls to the Slow Horses to work out how everything is connected.”", "Adding, “After all, Jackson Lamb knows that in the world of espionage, ‘London Rules’ should always apply.”", "In 2022, ", "rolled out on Apple TV+ and instantly became the best-reviewed comic spy drama and has entered into one of the top shows on the streamer."]},
{"title": "‘Oppenheimer' star Cillian Murphy listens to ‘jokes' to focus on work", "headline": "‘Oppenheimer’ actor Cillian Murphy shares he wants to remain in a light mood during the shooting of his serious roles", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525528_1402330_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525528-oppenheimer-star-cillian-murphy-listens-to-jokes-amid-serious-roles", "description": ["Intense roles can be grueling—and, for, Cillian Murphy these kinds of characters are the hallmark of his career. So, during those roles, the actor said he needed lightness on the set to tackle them -- rib-tickling jokes are part of it.", "Speaking to the ", " the ", "star said he “can’t work unless there’s a lightness around the set,” noting, “There has to be some levity. A lot of the films I do are quite heavy and go to some dark, challenging places, and you have to be relaxed to do that.”", "He continued, “So I don’t walk around in a state of *** angst. I need to feel at ease. I can’t be in that dark place all the time. I don’t have the stamina for it.”", "In ", ", he played one of his career’s most serious roles. So, to make himself feel light on set; the Irish actor revealed he turned to Emily Blunt, who played his on-screen wife Kitty.", "Crediting her jokes, Cillian called her “one of the funniest people” he’s met as the pair struck up a close bond during filming."]},
{"title": "Prince Harry to get 'restless' as he 'longs' for another 'fresh start' in 2024", "headline": "Prince Harry will get a chance to make a fresh start in new year 2024", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525526_6136774_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525526-prince-harry-to-get-restless-as-he-longs-for-another-fresh-start-in-2024", "description": ["Prince Harry will seemingly make another fresh start in 2024, reveals an astrologer.", "The Duke of Sussex will find a new abode and face major changes in his lifestyle starting the month of April.", "Debbie Frank, confidante and astrologer of Princess Diana, tells Hello!: “April is Harry's bombshell month. Jupiter and Uranus move across his Moon, triggering a shockwave that takes Harry out of the nest he's cultivated in Montecito.", "\"He's restless and longing for another fresh start which means upping sticks again with his family and doing what the royal family least expects.\"", "\"His Moon is placed in stability-loving Taurus and as the last few years have rocked the boat of his emotional security, he's going to take things to the next level this time. Jupiter and Uranus stage an ambush that thrusts him centre stage.", "She added: \"It changes things within the nuclear family and also in the wider one, enabling him to alter the set-up or setting. A move to a new home and/or a new place within or outside of the house of Windsor? The lunar eclipse on September 18 close to Harry's birthday completes this outlook.\""]},
{"title": "Kanye West, Bianca Censori prove expert predictions wrong?", "headline": "Famous psychic predictions about Kanye West and Bianca Censori seemingly fall flat", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525521_1804083_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525521-kanye-west-bianca-censori-prove-expert-predictions-wrong", "description": ["Kanye West has a history of unpredictability. So, when a noted psychic predicted his wife Bianca Censori would not be his priority in the new year -- the Chicago rapper dropped her racy photos which suggested otherwise.", "Inbaal Honigman previously shared her tarot card reading about the pair, claiming some friction will arise between the duo at the start of the year. ", "In an apparent reaction, the ", " hitmaker almost laid bare his better half in risqué outfits on Instagram.", "\"They'd have loved to have an evening just for themselves, the Hermit card suggests. They can see how public life interferes with their relationship, and they miss the days that they could just stay at home together and hide,\" the popular clairvoyant said. ", "She claimed, \"But Kanye has his own ideas for the year. He is in no hurry to shelf his plans and make his wife a priority. They will be arguing and disagreeing during the first few days of the year.\"", "On the contrary, the provocative snaps with apparently Bianca's nod signal the couple are on the same page.", "Inbaal further noted, \"The two of Wands card lets us know that Kanye has his goals for the coming year set firmly in his mind, and Bianca does too, and they can't decide whose are more important.\""]},
{"title": "Kate Middleton 'shopping name' unveiled to avoid public attention", "headline": "Kate Middleton uses a different name during her shopping expeditions", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525523_1333403_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525523-kate-middleton-shopping-name-unveiled-to-avoid-public-attention", "description": ["Kate Middleton seemingly likes to refer to herself with a secret name during shopping expeditions.", "The Princess of Wales conceals her identity with a moniker that is known to her close friends.", "Owner, of a wetsuit brand form which the Princess recently made a purchase, Dave Buckland, talks about his experience.", "When asked for her name to reserve the good, she responded: \"Mrs Cambridge.\"", "A pal then revealed to the Mail on Sunday: \"He was looking straight at her and actually commented that it was quite an unusual surname.", "\"He hadn't a clue who she was. She just smiled and said she'd be back. He hasn't lived it down since.\""]},
{"title": "NFL slaps Panthers owner with $300,000 fine over drink toss", "headline": "David Tepper issued an apology, acknowledging his regrettable behaviour during the game", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525529_2834810_updates.jpg", "category": "Sports", "URL": "https://www.geo.tv/latest/525529-nfl-slaps-panthers-owner-with-300000-fine-over-drink-toss", "description": ["Carolina Panthers' owner, David Tepper, faced a hefty $300,000 fine from the NFL for throwing a drink at opposing fans during a game against the Jaguars in Jacksonville. ", "The league condemned his actions as \"unacceptable conduct\" following the Panthers' devastating 26-0 loss, marking their plummet to a dismal 2-14 season.", "Tepper issued an apology on Tuesday, acknowledging his regrettable behaviour during the game. \"I am deeply passionate about this team and regret my behavior on Sunday,\" he stated, expressing remorse for his actions. Admitting his mistake, Tepper recognized that he should have allowed NFL stadium security to handle any arising issues, emphasizing his respect for the league's code of conduct and willingness to accept the imposed discipline.", "The incident occurred right after Carolina's quarterback, Bryce Young, faced interception in the final moments of the game, sealing their defeat and securing the league's worst record for the season. This outcome typically would have granted the Panthers the top pick in the upcoming NFL Draft. However, this selection had been traded away the previous year to acquire Young as the top pick for Carolina.", "Despite Tepper's acquisition of the Panthers in 2018 for over $2 billion, the team has endured a challenging six-year period, experiencing six consecutive losing seasons and tallying a disappointing 31-67 record under his ownership.", "Additionally, this recent defeat marked the Panthers' first shutout in 342 games since 2002, underscoring the gravity of their performance dip. Notably, David Tepper, a 66-year-old billionaire hedge fund owner, also holds ownership of Charlotte FC in Major League Soccer, expanding his sporting interests beyond the realm of American football.", "Tepper's actions during the Jaguars game sparked controversy and disciplinary action from the NFL, casting a shadow over the struggling Panthers' already challenging season. The team and its owner now face added scrutiny and pressure as they navigate the aftermath of this incident within the league and among fans."]},
{"title": "Who wants to ‘dream collab' with Miley Cyrus?", "headline": "Jelly Roll publicly reveals his wish calling a collab with Miley Cyrus his ‘dream’", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525531_9060552_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525531-who-wants-to-dream-collab-with-miley-cyrus", "description": ["Miley Cyrus is truly a sensation in the pop world and rapper Jelly Roll is so keen to collaborate with her that he called it his dream.", "The wish came to the fans' notice after a user asked the Save Me rapper during an Instagram Q&A session whether he would team up with the ", " hitmaker for a song. To which, he responded, \"Dream collab.\"", "Moreover, calls are growing urging the pair to do a collab together as Jelly dropped a comment on the ", "star post earlier this month.", "\"Love a good Nashville party,\" the 39-year-old commented on the post which the Grammy-nominated singer captioned “Definitely a Nashville party,\" pointing to her hit song", ".", "“You and @mileycyrus doing a country collab would be sick,\" one fan said. ", "A second wrote, \"Can we get a Jelly Cyrus collab we need this.\"", "In the meantime, for the 2024 Grammy awards, Miley and Jelly both are in the race for the coveted trophy."]},
{"title": "Selena Gomez hints towards early retirement ", "headline": "Selena Gomez released her last studio album Rare in 2020", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525530-selena-gomez-hints-towards-early-retirement", "description": ["Selena Gomez recently opened up about her career as a singer and if she is planning to release another album soon.", "While talking on an episode of the ", "podcast, releasing on January 7, the 31-year-old artist reflected on her decades-long work. ", "“I started having a lot of fun with music and then touring was really fun. But I was doing my TV show ", " at the same time and I just found it really fun so I just kept going,” she recalled.", "Selena added: “But the older I get, the more I’m kind of like, ‘I would like to find something to just settle on.'”", "Hinting towards an early retirement, the ", "hitmaker confessed that she only has “one more album” left in her, “I would probably choose acting. I want to chill because I’m tired now.”", "Selena released her last album Rare in 2020 and simultaneously worked on movies like ", ", ", "as an executive producer.", "However, the ", "mogul hasn't performed live since she postponed her 2016 Revival tour because of mental health issues related to her lupus diagnosis.", "Selena was later diagnosed with bipolar disorder and sought treatment at a mental health facility following the tour."]},
{"title": "America Ferrera gets honest about feminism in ‘Barbie'", "headline": "‘Barbie’ star America Ferrera addresses flak about feminism ‘oversimplification’ in the film", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525543_9527881_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525543-america-ferrera-gets-honest-about-feminism-in-barbie", "description": ["In ", ", themes of feminism were a mainstay. Now, actress America Ferrera is taking aim at the criticism the blockbuster film faced related to the focus on the women's rights movement.", "In a chat with ", ", the ", " star said, “We can know things and still need to hear them out loud. It can still be cathartic.\"", "Adding, \"There are a lot of people who need Feminism 101, whole generations of girls who are just coming up now and who don't have words for the culture that they're being raised in.\"", "She continued, “Also, boys and men who may have never spent any time thinking about feminist theory.\"", "\"If you are well-versed in feminism, then it might seem like an oversimplification, but there are entire countries that banned this film for a reason,\" the 39-year-old stated.", "The California native further noted, \"To say that something that is maybe foundational, or, in some people's view, basic feminism, isn't needed is an oversimplification.\" ", "\"Assuming that everybody is on the same level of knowing and understanding the experience of womanhood is an oversimplification,\" she said.", "America plays Gloria, who helps Margot Robbie on different counts and delivers a much-talked monologue in the film."]},
{"title": "King Charles gets sweet advice over abdication as he warned 'monarchy is in state of crisis'", "headline": "Britain's King Charles should 'follow suit' as Queen Margrethe II abdicates to allow the monarchy to undergo a revamp", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525547-king-charles-gets-sweet-advice-over-abdication-as-he-warned-monarchy-is-in-state-of-crisis", "description": ["Britain’s King Charles has been warned that the ‘monarchy is in a state of crisis’ and his abdication would save it.", "Former Labour MP Stephen Pound has said that King Charles should “follow suit” as Queen Margrethe abdicated to allow the monarchy to undergo a revamp, according to ", "He said, “The monarchy is in a state of crisis. We have had the worst few years. Would it be a wonderful thing if King Charles said, ‘I think it’s time for a reset?'", "“I think it would be a wonderful thing. He would save the monarchy.”", "Stephen Pound went on to say, “Let’s give them a restart. Let’s kickstart the monarchy.”", "King Charles is facing the growing calls to abdicate after Denmark´s popular Queen Margrethe II, Europe´s longest-serving monarch, said Sunday that she would abdicate on January 14 and pass the baton to her son Crown Prince Frederik.", "Earlier, British author Simon Jenkins, in his opinion piece for ", " also urged that the King should follow Denmark’s example – “and tell us when he’ll abdicate.”"]},
{"title": "Taylor Swift and Travis Kelce: Conspiracies about relationship dismissed", "headline": "Taylor Swift and Travis Kelce celebrated the New Year together and their romance video went viral", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525545_9744212_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525545-taylor-swift-and-travis-kelce-conspiracies-about-relationship-dismissed", "description": ["Travis Kelce's managers have dismissed conspiracies and rumours involving his girlfriend Taylor Swift as the lovebirds are going strong in their relationship.", "The Kansas City Chiefs tight end and the ", " singer were first linked in September and went public with their relationship the following month.", "Now, according to ", ", Andre and Aaron Eanes, who handle Kelce's business affairs, in an interview with the ", " have dismissed rumours that Travis Kelce and Taylor Swift's romance is a publicity stunt.", "Aaron told the publication, “People say to me, 'Man, it's been a crazy year. When I say, 'Actually, it's not that crazy,' people look at me funny. It's because it's easy when you have a plan. We're executing that plan.\"", "André Eanes said, \"We positioned Travis to be world famous. We didn't know how it would happen, or when it would happen, or what would help push that further along. But it's always been the thought in the back of our minds.\" ", "Andre and Aaron Eanes remarks came after Swift and Kelce celebrated New Year together and their romance video went viral."]},
{"title": "Faizabad sit-in probe: Ex-DG ISI Faiz Hamid 'skips' hearing for the 3rd time", "headline": "Probe panel is now considering recording the former spymaster's statement via video link, say sources", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525532_3448536_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525532-gen-retd-faiz-fails-to-appear-before-faizabad-sit-in-commission-again", "description": ["Despite repeated summons, former ISI chief Lt Gen (retd) Faiz Hamid Tuesday again failed to appear before the Faizabad inquiry commission formed to probe the 2017 protest sit-in staged by Tehreek-e-Labbaik Pakistan (TLP), ", " reported.", "According to sources, the commission had summoned the former spy chief at 10.30am on Tuesday but he did not appear before the panel.", "The commission is now considering a proposal to record his statement through video link, the insiders added.", "This was the third time that the former ISI chief remained absent from the hearing being conducted by the inquiry commission, which earlier summoned him in the second week of December last year and then on December 29, sources said. However, the first notice couldn’t be delivered.", "In November last year, the caretaker federal government constituted the inquiry commission for the implementation of the top court’s 2019 Faizabad verdict.", "The probe panel was constituted on the order of the Supreme Court of Pakistan under the chair of retired IGP Akhtar Ali Shah after the apex court rejected the fact-finding committee report constituted by the government.", "On November 15, Chief Justice Qazi Faez Isa had remarked that the commission would be empowered to summon anyone, including former army chiefs, prime ministers and chief justices.", "The inquiry commission is required to submit its report to the top court on January 22.", "The probe panel has also summoned Pakistan Muslim League-Nawaz (PML-N) President and former prime minister Shehbaz Sharif on January 3 (today), sources had told Geo News on Monday.", "Earlier, former prime minister Shahid Khaqan Abbasi, ex-interior minister Ahsan Iqbal, then-secretary to PM Fawad Hasan Fawad and other senior officials serving in Islamabad and Punjab who were involved in the episode had appeared before the probe panel.", "In November 2017, the top court had taken suo motu notice of the three-week-long sit-in, which was held against a change in the finality-of-Prophethood oath, termed by the government as a clerical error, when the government passed the Elections Act 2017.", "The sit-in was called off after the protesters reached an agreement with the government.", "On February 6, 2019, a two-member bench of the apex court comprising the now-CJP Isa and Justice Mushir Alam recommended that persons, issuing an edict or fatwa to harm another person or put another person in the harm’s way must be dealt with iron hand and prosecuted under relevant laws.", "It also ruled that the intelligence agencies must not exceed their respective mandates. Later, the bench disposed of a suo moto case regarding the 2017 Faizabad sit-in staged by the TLP.", "The 43-page verdict issued by the two-judge bench and published on the apex court's website read: “Every citizen and political party has the right to assemble and protest provided such assembly and protest is peaceful and complies with the law imposing reasonable restrictions in the interest of public order.", "“The right to assemble and protest is circumscribed only to the extent that it infringes on the fundamental rights of others, including their right to free movement and to hold and enjoy property.”"]},
{"title": "Kanye West draws backlash for explicit photos of Bianca Censori", "headline": "Kanye West posted a string of images featuring Bianca Censori 'not wearing pants'", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525544_3898286_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525544-kanye-west-draws-backlash-for-explicit-photos-of-bianca-censori", "description": ["Kanye West drew severe backlash after he posted a string of NSFW pictures of his wife Bianca Censori. ", "The rapper took to his Instagram account of 18.4 million followers and posted three pictures of his wife, with one of them captioned: “No pants this year.”", "Kanye flaunted the Australian architect who was just wearing a thong and a tight fur top, exposing her front side. ", "Another sultry mirror selfie of himself with Bianca shows her standing to the side, wearing a black corset, a leather trench coat, and a string bikini.", "Kanye's followers slammed him for the choice of images he posted and reminded him that his kids might see this: “Bro your kids are on this app,” wrote one user.", "Another follower penned: “Your daughter is going to see this s***. Way to set an example. Great dad right here.”", "“What if this was one of your daughters? Would you say the man who took it and posted it loves them? Respect them?\" another disappointed netizen chimed in."]},
{"title": "Pakistan needs transition from hybrid system to normal democracy: Pildat", "headline": "Political parties suffer from crisis of confidence as their fate depends how \"adept they're at keeping GHQ positively engaged\"", "time": "\nWednesday, January 03, 2024 ", "author": "Asim Yasin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525535_5005242_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525535-pakistan-needs-transition-from-hybrid-system-to-normal-democracy-pildat", "description": ["ISLAMABAD: The Pakistan Institute of Legislative Development and Transparency (Pildat) has called for an urgent transition from a hybrid system to a normal functional democracy, ", " reported Wednesday. ", "\"The year 2023 has only made the transition towards improved democracy harder for Pakistan which is now called an electoral autocracy by some international democracy rating think tanks,\" said the institute in its Quality of Democracy report for 2023.", "Pildat has pointed out that while democracy was “stuck in a familiar and deepening rut at the end of 2023”, there are “remedies and lessons” that are obvious “but the people who have the power and capacity to pull the country out of the rut have not taken the right steps for the last ‘seventy years’, borrowing the phrase former Chief of Army Staff, General (r) Qamar Javed Bajwa used while referring to his institution’s interference in the country’s political affairs.” ", "According to the institute, political parties and popular leaders in Pakistan continually suffer from a crisis of confidence as their political fate depends “not on their popularity or the cogence of their governance policies but how adept they are at keeping the GHQ positively engaged and [playing] second fiddle”.", "With political campaigns being forced to move between pro- and anti-establishment sides, it is the people who lose in the end, says Pildat, adding that: “neither[is] the army learning to steer clear of politics and focus solely on the security domain defined in the constitution, nor [have] the politicians agreed on an unbreakable set of rules to never seek or receive the army’s support”.", "As far as the fairness and credibility of the coming elections go, the report does not paint a happy picture: “As Pakistan prepares to hold yet another general election, the prospect of its fairness appears just as bleak as the 2018 General Election...” It also chides political parties for being apparently “addicted to the establishment’s patronage” to win a “managed public popularity and form fractured governments.”", "Pildat believes that the conclusion of the 15th National Assembly in 2023 left democracy just as vulnerable and manipulated as it was when the assembly members took oath on August 12, 2018, with the National Assembly and its members having “allowed themselves to be manipulated by one elected government to the other, with active control of the establishment, in carrying out basic functions such as legislation.”", "And of the Senate, the report is no less stringent in its assessment, calling the Senate little more than “a debating club where, instead of initiating and leading a meaningful engagement on policy issues, its sessions remained just as mired in partisan political blame-game, infighting and political mocking of opponents.” ", "Likewise, the provincial assemblies too were used by each provincial government “to rubber-stamp required legislation including the most important provincial budgets.” ", "Pildat says that in their five-year tenure, provincial assemblies “willfully began to regress and withdraw public information from the citizens”, their websites offering “scant, outdated and incomplete information”.", "On Chief Justice Qazi Faez Isa, the report says the current chief justice “has initiated many firsts since holding office”. Per Pildat, the CJ’s latest “and somewhat controversial achievement to date in the context of Pakistan’s democracy, has been nudging the reluctant decision-makers to finally appoint a firm date and issue a schedule for the 12th General Election to be held on February 08, 2024.”", "There was no improvement in the freedom of the media in Pakistan, according to the Pildat report. It adds that the year again “proved yet again the silencing of independent voices, the management of media and the propagation of the sickening culture of buying media voices in support of or against a political party or group to sow polarisation and dissent in the society.”", "From taking channels or TV anchors off air to not allowing images, messages or statements from political leaders “newly fallen out of favour” to not allowing certain topics like “Balochistan and [the] Pashtun Tahaffuz Movement”, the report paints a picture of a news media facing tight controls.", "The Pildat report does not see President Arif Alvi’s performance as anything to write home about, saying that the president “failed to evolve in the role of a non-partisan president failing to fulfil not just the requirement of the Constitution but in defying all political, official and moral norms in holding the highest elected office in Pakistan.”", "Adding that President Alvi ignored all criticism for playing a “blatantly partisan role” in favour of the PTI, the Pildat report says that his role became especially controversial in appointing a date for the general election to the dissolved Punjab Assembly “when he unilaterally, and without constitutional authority, appointed the date of election.” ", "The president also, says Pildat, defied his constitutional role repeatedly when it came to giving his assent to various laws passed by parliament once the PDM coalition government came into power, and continued to do so in 2023."]},
{"title": "Nicki Minaj's honest opinion irks fans: Watch", "headline": "Fans disapprove of Nicki Minaj's sounds off on her hit track ‘Starships’ amid performance", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525541_4766570_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525541-nicki-minajs-honest-opinion-irks-fans-watch", "description": ["Nicki Minaj has a strong opinion especially when it comes to her music choice. As evidence, the pop rockstar abruptly ended her hit ", " track despite fans' disapproval — because she doesn’t like the song.", "The incident happened at E11EVEN nightclub where the Grammy-nominated singer was performing for New Year’s Eve night.", "In a fan-obtained footage, the Trinidad and Tobago rapper was seen spitting the bars of the 2012 song; only to signal it to be turned off after a few seconds later.", "“Hold on, psych, psych,” the 41-year-old gestured to cut the music off which prompted screeches from fans.", "The 41-year-old said, “I don’t perform that song no more y’all. I don’t like it, what y’all want me to do? Stupid song.”", "Nicki previously slammed her track. “I hate ‘Starships,’ I mean ew, ‘Starships?’ I’m like, ‘Why did I do that?’ I really think that every time I hear it,” she told Pollstar Live.", "Not to mention, she had also sounded off on her other super-hit track 2014's ", ", adding she regretted ever recording it."]},
{"title": "People getting sick by influenza in Pakistan, not COVID-19: NIH", "headline": "\"Poor air quality, smog adds to chances of respiratory illnesses. It is not COVID-19, but flu viruses,\" says epidemiologist ", "time": "\nWednesday, January 03, 2024 ", "author": "M. Waqar Bhatti", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525546_1455164_updates.jpg", "category": "Health", "URL": "https://www.geo.tv/latest/525546-people-getting-sick-by-influenza-in-pakistan-not-covid-19-nih", "description": ["ISLAMABAD: The National Institute of Health (NIH) Islamabad has clarified that a type of influenza virus is causing severe respiratory illness in adults across Pakistan and not COVID-19, ", " reported Wednesday. ", "Thousands of influenza-like illness (ILI) cases are being reported daily in the country, said the health institute, adding that the H3N2 sub-type of Influenza-A virus is causing the illness. ", "Among children, it is Respiratory Syncytial Virus (RSV) which is leaving them sick across Pakistan, NIH officials said. They urged people to take precautionary measures, including coughing etiquette, to prevent themselves from contracting respiratory illnesses.", "“No, it is not COVID-19 that is making people sick these days in Pakistan. Our surveillance and testing indicates it is H3N2 sub-type of Influenza-A which is making people sick in Islamabad, Rawalpindi, many cities of Sindh and most of Punjab these days”, a senior official of NIH told ", ".", "The health official said people were blaming COVID-19 for respiratory illnesses. COVID-19 positivity remained less than 1% during last week when only 16 cases were detected across Pakistan after 3,609 tests conducted, he claimed. The majority of people were neither getting tested for COVID-19 nor the influenza-like illness, he added.", "Severe Acute Respiratory Infections (SARI) were being reported from Khyber Pakhtunkhwa and Balochistan, the NIH official said.", "According to NIH data, around 46,000 cases of ILI were reported in the country except Punjab during the 49th week of the year. The highest number of ILI cases was reported from Sindh where over 25,000 were detected, KP reported 8,354 cases, Balochistan 7,856 cases and Azad Jammu and Kashmir 3,619 cases.", "Punjab, from where the bulk of respiratory illnesses are being reported, doesn’t share its data with NIH Islamabad. So, the authorities don’t have any idea of the respiratory disease burden in the largest province of Pakistan.", "Commenting on the influenza outbreak in Pakistan, renowned infectious diseases expert Dr Faisal Sultan said influenza was being diagnosed more (due to the availability of PCR at many centres). “It is sometimes prolonged with weeks of fatigue associated with it,\" he said.", "\"It’s known in some instances it can have a prolonged convalescence. Additionally, the vulnerable parts of the population — elderly or with other heart or lung conditions — will have more complications (bacterial pneumonia),” Dr Sultan said.", "Health experts and pulmonologists in Karachi also confirmed influenza A was most commonly detected in the city as compared to COVID-19. It was causing severe disease to elderly people with comorbid (having other diseases like diabetes, hypertension etc), they said.", "\"Mostly, it is influenza. We have seen entire families infected with flu-like symptoms in Karachi. We have found the Infleunza-A virus as the cause of respiratory illness, sometimes causing the hospitalisation of the elderly with comorbid. In young adults it is self-limiting, which means they recover on their own,\" Dr Raeef Ahmed, a pulmonologist in Karachi, said.", "He urged people not to use antibiotics for the treatment of flu, saying that they had found good results of an antiviral medicine Tammy Flu among hospitalised adults.", "To a query regarding the availability of flu shots or influenza vaccine, he said the vaccine was not available in the market. Now, it was a bit late to get vaccinated against the flu, he added.", "Renowned epidemiologist Dr Rana Muhammad Safdar urged people to adopt the same precautions they used during the COVID-19 pandemic to prevent themselves from contracting the respiratory illness.", "\"Poor air quality, smog in Punjab, the federal capital, Khyber Pakhtunkhwa and other areas adds to chances of respiratory illnesses. It is not COVID-19, but flu viruses, which are making people sick,\" he said.", "Safdar advised the people to gargle with lukewarm salt water before going to bed to prevent chances of throat infection."]},
{"title": "Experts fear AI deepfakes can deceive voters in Pakistan, India other Asian nations", "headline": "With elections due in Pakistan, India among other countries misinformation is rife with deepfakes being particularly concerning", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525548_2800776_updates.jpg", "category": "Sci-tech", "URL": "https://www.geo.tv/latest/525548-deepfakes-deceive-voters-from-india-to-indonesia-before-elections", "description": ["Divyendra Singh Jadoun was busy making artificial intelligence-based visual effects and voice clones for film and television in India, when he began getting calls from politicians: could he create AI videos, or deepfakes, for their election campaign?", "With a hotly-contested local election in his home state of Rajasthan last November, and a national election due by May this year, the opportunity for his company, The Indian Deepfaker, is tremendous. But Jadoun was reluctant.", "\"The technology to create deepfakes is so good now, it can be done almost instantaneously, with very little effort - and people cannot tell if it's real or fake,\" said Jadoun, 30.", "\"There are no guidelines on deepfakes, and that's worrying, as it has the potential to influence how a person votes,\" he told the ", "Instagram reels of Indian Prime Minister Narendra Modi singing in regional languages have gone viral recently, as have TikTok videos of Indonesian presidential candidates Prabowo Subianto and Anies Baswedan speaking in fluent Arabic.", "But they were all created with AI, and posted with no label.", "With elections due in India, Indonesia, Bangladesh and Pakistan in the coming weeks, misinformation is rife on social media platforms, with deepfakes - video or audio made using AI and broadcast as authentic - being particularly concerning, say tech experts and authorities.", "In India, where more than 900 million people are eligible to vote, Modi has said deepfake videos are a \"big concern\", and authorities have warned social media platforms they could lose their safe-harbour status that protects them from liability for third-party content posted on their sites if they do not act.", "In Indonesia - where more than 200 million voters will go to the polls on Feb 14 - deepfakes of all three presidential candidates and their running mates are circulating online, and have the potential to influence election outcomes, said Nuurrianti Jalli, who studies misinformation on social media.", "\"From microtargeting of voters with disinformation to spreading false narratives at a scale and speed unachievable by human actors alone, these AI tools can significantly influence voter perceptions and behaviour,\" she said.", "\"In environments where misinformation is already prevalent, AI-generated content can further skew public perception and influence voting behaviour,\" added Jalli, an assistant professor at Oklahoma State University's media school.", "Deepfake images and videos churned out by generative AI tools such as Midjourney, Stable Diffusion and OpenAI's Dall-E popped up ahead of elections from New Zealand to Turkey and Argentina last year, with growing concerns about their impact on US presidential polls in November.", "AI makes the creation and spread of disinformation faster, cheaper and more effective, the US non-profit Freedom House said in a recent report.", "In Bangladesh — where Prime Minister Sheikh Hasina is set for her fourth straight term after polls on Jan 7 — deepfake videos of female opposition politicians Rumin Farhana in a bikini and Nipun Roy in a swimming pool have emerged.", "While they were debunked quickly, they are still circulated, and even poor-quality deepfake content is misleading people, said Sayeed Al-Zaman, an assistant professor of journalism at Bangladesh's Jahangirnagar University, who studies social media.", "\"Given the low levels of information and digital literacy in Bangladesh, deepfakes can be potent carriers of political propaganda if crafted and deployed effectively,\" he said.", "\"But the government does not appear concerned.\"", "The ministry of information did not respond to a request for comment.", "In Pakistan, where an election is scheduled for Feb 8, Imran Khan, who is in prison on an official secrets acts case after being ousted as prime minister last year, used a AI-generated image and voice clone to address an online election rally in December, which drew more than 1.4 million views on YouTube and was attended live by tens of thousands.", "While Pakistan has drafted an AI law, digital rights activists have criticised the lack of guardrails against disinformation, and to protect vulnerable communities including women.", "\"The threat that disinformation poses to elections and the overall democratic process in Pakistan cannot be stressed upon enough,\" said Nighat Dad, co-founder of the non-profit Digital Rights Foundation.", "\"In the past, disinformation on online platforms has managed to sway voting behaviour, party support, and even influenced legislation change. Synthetic media will make this easier to do,\" she added.", "At least 500,000 video and voice deepfakes were shared on social media sites globally in 2023, estimated DeepMedia, a company developing tools to detect synthetic media.", "Platforms have struggled to keep up.", "Meta, which owns Facebook, Instagram and WhatsApp, said it aims to remove synthetic media when the \"manipulation is not apparent and could mislead, particularly in the case of video content\".", "Google, which owns YouTube, said in November that the video sharing platform requires \"creators to disclose altered or synthetic content that is realistic, including using AI tools, and we'll inform viewers about such content through labels\".", "But countries including India, Indonesia and Bangladesh have recently passed laws to more closely police online content and penalise social media sites for content deemed misinformation, so platforms are \"holding their punches\", said Raman Jit Singh Chima, Asia policy director at advocacy group Access Now.", "In these countries, \"this election cycle is actually worse than the last cycle - platforms are not set up to handle problems, and they are not being responsive and proactive enough. And that's a very dangerous sign,\" he said.", "\"There is a danger that the world's attention is only on the US election, but the standards being applied there, the effort being made there should be duplicated everywhere,\" he added.", "In India, where Modi is widely forecast to win a third term, Jadoun — who had declined to make deepfake campaign videos for the state elections — is gearing up to make them for the general election.", "These will be personalised video messages from politicians for party workers, not voters, that can be sent on WhatsApp.", "\"They can really have an impact, because there are hundreds of thousands of party workers and they will, in turn, forward them to their friends and family,\" he said.", "\"But we will add a watermark to show that it is made with AI, so there is no misunderstanding. That's important.\""]},
{"title": "Meghan Markle 'humiliated' over memoir draft", "headline": "Royal expert Tom Bower had claimed “My information is that Meghan Markle is writing her memoir and it will be a huge money-spinner”", "time": "\nWednesday, January 03, 2024 ", "author": "William Blythe Haynes", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525549_8476672_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525549-meghan-markle-humiliated-over-memoir-draft", "description": ["Amid rumours of writing her own memoir, Duchess of Sussex Meghan Markle is said to be ‘humiliated’ and left red-faced after the publishers demanded she must submit its draft before payment.", "This has been claimed by royal expert Neil Sean after reports Meghan Markle was writing her own memoir and would document the details of her life in the 'money-spinning tell-all book'.", "Neil Sean claimed on his YouTube channel that a few publishers did show interest in Meghan and feel that could make a buck but it's all about the money they would have to shell out.", "The royal expert said, “Can you imagine the humiliation when they said they'd like to see at least three chapters first to see how the story pans out.”", "\"In the world of publishing, this means one thing. They want to see if you've got a worthwhile story,” he said and added “The sticking point is they can't trust giving anything out to a publisher without top level security because it could get leaked and then the whole deal will be ruined.\"", "Earlier, royal expert Tom Bower had claimed, “My information is that she (Meghan) is writing her memoirs and it will be a huge money-spinner.”"]},
{"title": "Birmingham City sack manager Wayne Rooney after 15 Championship games", "headline": "\"It will take me some time to get over this setback,\" Rooney says, bidding farewell to football club", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525536_1562186_updates.jpg", "category": "Sports", "URL": "https://www.geo.tv/latest/525536-birmingham-city-sack-manager-wayne-rooney-after-15-championship-games", "description": ["Birmingham City on Tuesday, sacked manager Wayne Rooney who won just two of his 15 Championship matches at the helm, seeing the club slip from sixth to 20th in the table, ", " reported.", "First-team coach Carl Robinson has also been dismissed.", "A club statement read: \"Birmingham City has today parted company with manager, Wayne Rooney, and first-team coach, Carl Robinson. ", "\"Despite their best efforts, results have not met the expectations that were made clear at the outset. Therefore, the board feels that a change in management is in the best interests of the football club.", "\"The club’s board and management are fully aligned and will continue to drive transformation and take bold steps to rebuild Birmingham City into the organisation its fans and community deserve. The board would like to place on record their sincere thanks to Wayne and Carl for all of their efforts.\"", "Reacting to the sacking, the former English footballer said: \"I would like to thank Tom Wagner, Tom Brady and Garry Cook for the opportunity to manage Birmingham City and the support they all gave me during my short period with the club.", "\"Football is a results business – and I recognise they have not been at the level I wanted them to be. However, time is the most precious commodity a manager requires and I do not believe 13 weeks was sufficient to oversee the changes that were needed.", "\"Personally, it will take me some time to get over this setback. I have been involved in professional football, as either a player or manager, since I was 16. Now, I plan to take some time with my family as I prepare for the next opportunity in my journey as a manager.\"", "He also wished the football club and its owners best wishes in the \"pursuit of their ambitions\".", "Meanwhile, professional development coach Steve Spooner will be in charge until a permanent successor is found.", "Rooney, who was appointed when Birmingham was in a promotion play-off spot, has been criticised for his poor run of results, including nine league defeats, leaving the club two places above the drop zone.", "The former Everton and Manchester United forward left Derby County after 19 months due to a 21-point deduction and a lack of success in the 2021-22 season. He also served 15 months at Major League Soccer (MLS) side DC United, leaving in October after failing to qualify for the playoffs."]},
{"title": "King Charles to abdicate in 'five or ten years'", "headline": "King Charles may be influenced by Queen Margrethe's move to abdicate and pass baton to Prince William", "time": "\nWednesday, January 03, 2024 ", "author": "William Blythe Haynes", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525556-king-charles-to-abdicate-in-five-or-ten-years", "description": ["Britain’s King Charles is expected to follow in the footsteps of Queen Margrethe II and handover the crown to his elder son Prince William.", "Denmark´s popular Queen Margrethe II, Europe´s longest-serving monarch, said Sunday that she would abdicate on January 14 and pass the baton to her son Crown Prince Frederik.", "Royal biographer Phil Dampier told ", ", per the ", " that King Charles may be influenced by Queen Margrethe's move.", "He said, \"It must make you wonder if in five or ten years’ time King Charles might think about doing the same if his health suffers or he just thinks it is a good time to pass on to William and Kate while they are still young.”", "The royal expert went on to say, “Our late Queen would never abdicate because of what happened in 1936 when her uncle abdicated and her father came to the throne. But times change.\" ", "It is also to be mentioned here that Prince William and Kate are very friendly with Crown Prince Frederik and Crown Princess Mary. "]},
{"title": "PML-N faces internal rifts as heavyweights jostle for party tickets", "headline": "Differences emerge between Sheikh Rohail, Sadiq and other party leaders over tickets for upcoming elections, say sources", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525542_7066943_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525542-pml-n-faces-internal-rifts-as-heavyweights-jostle-for-party-tickets", "description": ["LAHORE: The Pakistan Muslim League Nawaz (PML-N) is currently in a fix with its heavyweights got engaged in a rift over party tickets to compete in the upcoming elections, scheduled to take place on February 8, ", "reported citing sources on Wednesday.", "The party has, therefore, not yet resolved the tussle between these party leaders for the distribution of tickets in some of the constituencies where they wish to contest polls.", "PML-N supremo Nawaz Sharif, on Tuesday, chaired a meeting of his party leaders at his Jati Umrah residence, where discussions were held to discuss the differences between those clashing over tickets for certain constituencies.", "According to the sources, the meeting held consultations for the second day on the issue of distribution of tickets in the general elections but it failed to reach any conclusion.", "The sources added that efforts were made for reconciliation between the party leaders including Ayaz Sadiq, Sheikh Rohail Asghar and Talal Chaudhry, among others.", "Asghar, as per the sources, wants to contest elections from NA-121 and categorically refused to withdraw his papers in the last party meeting in favour of Sadiq.", "The sources mentioned that 12 union council chairmen from NA-121 have expressed their support to Sadiq, who has also submitted his nomination papers from NA-119 and NA-117.", "Similarly, differences also appeared between Talal Chaudhry and Nawab Sher Wasir over NA-96 Jaranwala, said sources, adding separate strong groups in PML-N were supporting Chaudhry and Sher Wasir.", "The sources said that the issue of seat adjustment with the Istehkam-e-Pakistan Party (IPP) was also discussed in the PML-N meeting. They claimed the party leadership was ready to give one National Assembly and two provincial assembly seats to IPP in Lahore but some raised objections.", "Meanwhile, the sources claimed that the dispute between Ahsan Iqbal and Daniyal Aziz was also not resolved as the former submitted nomination papers in PP-54 and PP-54 Narowal.", "These seats fall under NA-75 from where Daniyal Aziz was contesting elections and wanted party tickets for these two provincial assembly seats for his blue-eyed persons."]},
{"title": "Kanye West 'exhausts' Miami hotel's staff ", "headline": "Kanye West is currently staying at his favorite five-star hotel Four Seasons, in Miami", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525555_5188465_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525555-kanye-west-exhausts-miami-hotels-staff", "description": ["Kanye West’s favorite luxe hotel in Miami has reportedly had it with him.", "According to ", ", the Canadian rapper overstayed his welcome at hotel Four Seasons as he has made himself at home at the venue’s Surf Club resort and even built a recording studio there.", "Despite the hotel’s location being outside of the South Beach neighborhood, which is well known for parties, the outlet claims that the security staff is pretty annoyed by Kanye's late night visitors.", "The report comes after Kanye recently performed during the Art Basel festival and the hotel had around 15 SUVs causing a commotion till 5 in the morning.", "The hospitality personnel isn’t the only one allegedly irked by the ", "hitmaker who also upset his followers recently by posting explicit pictures of wife Bianca Censori.", "He took to his Instagram account of 18.4 million followers and posted three pictures of the Australian architect, with one of them captioned: “No pants this year.”", "Kanye's followers slammed him for the choice of images he posted and reminded him that his kids might see this: “Bro your kids are on this app,” wrote one user.", "Another follower penned: “Your daughter is going to see this s***. Way to set an example. Great dad right here.”"]},
{"title": "Cardi B surpasses Offset with major New Year's Eve gig", "headline": "Cardi B & Offset parted ways in December 2023 following the latter's cheating allegations", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525551_9927614_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525551-cardi-b-surpasses-offset-with-major-new-years-eve-gig", "description": ["Cardi B continues to thrive and make more money than estranged husband Offset.", "The two rappers, who announced their split in December 2023, were hired on New Year’s Eve to perform at a hotel in Miami. ", "A source recently revealed to ", "that Cardi, whose real name is Belcalis Marlenis Almánzar Cephus, received $1 million for her performance at the Fontainebleau pool.", "On the other hand, her baby daddy made a “fraction” of that amount with his gig at the hotel’s nightclub LIV.", "“She made at least double what Offset was paid,” the tipster spilled.", "While Offset's tickets peaked at about $15,000, the most expensive ones for Cardi's performance were sold at $25,000.", "Prior to this, the ", "hitmaker also made a shocking revelation about the NYE party she attended with the ", "crooner.", "After her video of partying with Offset at a Miami strip club went viral, Cardi told her fans on Instagram: “Was I clubbing with my baby daddy, yes. Did I get d*** down on New Year's Eve, yes. I needed d*** on New Year's Eve,” she revealed."]},
{"title": "Aamer Jamal leads Pakistan to 313 after top-order failure", "headline": "Australia skipper Pat Cummins took five for 61 for his third successive five-wicket haul in the series", "time": "\nWednesday, January 03, 2024 ", "author": "Sports Desk", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525572_805761_updates.jpg", "category": "Sports", "URL": "https://www.geo.tv/latest/525572-aamer-jamal-leads-pakistan-to-313-after-top-order-failure", "description": ["SYDNEY: Gritty Pakistan clawed back from looming disaster to finish with 313 on the back of fighting half-centuries from Mohammad Rizwan, Agha Salman and Aamer Jamal on the first day of the third Test against Australia on Wednesday.", "The tourists, staring down a meagre innings total at 96 for five after winning the toss, counter-attacked to frustrate the Australians at the Sydney Cricket Ground.", "Rizwan clubbed 88 off 103 balls, number nine Jamal a spirited 82 off 97 and Salman 53 off 67 to give the tourists some hope after a car-crash start to the innings.", "David Warner, playing in his 112th and final Test, had to see off a tense final over before the close and survived a scare before finishing with six in Australia’s reply of 6-0.", "Australia skipper Pat Cummins took five for 61 for his third successive five-wicket haul in the series.", "In a day that began in elation for Australia ended in frustration as Pakistan’s tail wagged furiously to rescue their side after a terrible start.", "Mohammad Rizwan and Agha Salman triggered the comeback with a spirited 94-run stand to defy the Australia attack.", "Rizwan, who had been dropped for the first Test, blasted two sixes and 10 fours off 103 balls before he fell to a legside trap set by Cummins.", "Rizwan top-edged a pull shot for Josh Hazlewood to take the catch at fine leg after posting the highest individual score by a Pakistan batsman of the series.", "Salman took up the cudgels with a half-century before he was caught by Travis Head off Mitchell Starc.", "Jamal kept the fightback going as he registered his highest Test score before he fell to Nathan Lyon.", "That left Warner to see out the final over of the day and he began with a flourish, cutting the first ball for four from spinner Sajid Khan.", "It was a rousing morning session for Australia as openers Abdullah Shafique and debutant Saim Ayub were dismissed inside two overs.", "The out-of-form Shafique fell to the second ball of Starc’s opening over and Ayub, brought in for Imam-ul-Haq to make his Test debut, only lasted two balls before a Hazlewood outswinger had him caught behind by Alex Carey.", "Babar Azam hit three glorious cover drives to the ropes before he was out for 26.", "Cummins appealed vociferously for lbw but was turned down by the umpire, only to seek a review and get the verdict, leaving the tourists tottering at 39 for three.", "Saud Shakeel copped a nasty blow on the collarbone from a Cummins lifter and in the Australian skipper’s next over he prodded a catch behind to Carey for five, leaving his side further in the mire at 47 for four.", "Skipper Shan Masood, on 32, was caught by Smith at second slip off Mitchell Marsh just after lunch but it was ruled a no-ball.", "Marsh got the last laugh two overs later when Masood, on 35, again edged the medium-pacer to Smith in almost identical fashion to leave Pakistan at 96 for five.", "Australia clinched the three-match series with a tense 79-run win in the second Test in Melbourne over Christmas."]},
{"title": "Royal family announces changes in titles after Queen Margrethe abdication", "headline": "Denmark's popular Queen Margrethe II, Europe's longest-serving monarch, said Sunday that she would abdicate on January 14 and pass the baton to her son Crown Prince Frederik", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525566_4850859_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525566-royal-family-announces-changes-in-titles-after-queen-margrethe-abdication", "description": ["Denmark's royal family has announced new titles for the senior royals when Crown Prince Frederik accedes to the throne on January 14 after surprise abdication of Queen Margrethe.", "The Danish Royal House has issued a statement about the title changes.", "According to the statement, “On Sunday, 14 January 2024, HRH The Crown Prince assumes the Danish throne as HM King Frederik the 10th.”", "It further said, “At the same time, HRH The Crown Princess will be known as HM Queen Mary. The Royal Couple will henceforth bear the title The King and The Queen of Denmark.”", "“HRH Prince Christian becomes the heir to the throne and will henceforth be referred to as HRH Crown Prince Christian.”", "The statement further reads: “After the succession to the throne, HM The Queen will continue to be Majesty and bear the title HM Queen Margrethe.”", "The royal family also shared the statement on its official Instagram handle with caption which translates as “Changes in the royal family titles following the change of throne on the 14th. January 2024.”"]},
{"title": "In a first, Pakistan maintain run rate of over 4 in Test innings against Australia", "headline": "Mir Hamza, Aamer Jamal's impressive 86-run partnership becomes second-best for 10th wicket by Pakistan against Australia", "time": "\nWednesday, January 03, 2024 ", "author": "Faizan Lakhani", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525573_9060439_updates.jpg", "category": "Sports", "URL": "https://www.geo.tv/latest/525573-in-a-first-pakistan-maintain-run-rate-of-over-4-in-test-innings-against-australia", "description": ["SYDNEY: The Pakistan cricket team, captained by Shan Masood, showcased positive intent on Wednesday, achieving a noteworthy feat of scoring over four runs per over in a Test innings.", "On the first day of the Sydney Test, the team scored a total of 313 runs in 77.1 with a run rate of 4.05, making it the first instance of a Pakistani side maintaining a run rate of over four in a Test inning on Australian soil.", "This surpasses their previous best-run rate of 3.97, achieved during the 2019 Brisbane Test. ", "This outstanding display of batting can be considered a testament to the team's evolving skills and strategic approach.", "Another notable feat by Pakistan on day one of the Sydney Test is the remarkable partnership by the last-wicket duo, Mir Hamza and Aamer Jamal, who contributed an impressive 86 runs batting 133 balls.", "This partnership is the second-best for the 10th wicket by Pakistan against Australia, following the 87-run stand by Asif Iqbal and Iqbal Qasim in 1976.", "While the exact number of partnership balls between Asif and Iqbal is unavailable, the 133-ball stand between Hamza and Aamer stands out as the longest a 10th-wicket Pakistani pair has endured against the hosts in matches where partnership ball data is accessible.", "Pakistan were dismissed for 313 on the opening day of the third Test in Sydney. "]},
{"title": "UK implements strict student visa rules to curb 'abuse' of immigration system", "headline": "Restrictions impact postgraduate research courses and those with government-funded scholarships", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525560_7392416_updates.jpg", "category": "World", "URL": "https://www.geo.tv/latest/525560-uk-implements-strict-student-visa-rules-to-curb-abuse-of-immigration-system", "description": ["International students enrolling at universities in the United Kingdom starting this month will have to comply with stricter visa requirements that restrict the number of family members they may bring.", "The changes, initiated by former home secretary Suella Braverman to “slash migration and curb abuse of the immigration system” came into effect from Monday, according to the official website of the UK government.", "These restrictions primarily impact postgraduate research courses and those with government-funded scholarships.", "The UK Home Office anticipates that these changes — intended to prevent the abuse of student visas as a means of obtaining work — will cause about 140,000 fewer people to enter the country.", "“The changes, first announced last May, have also seen people banned from using the student visa as a backdoor route to work in the UK and will see an estimated 140,000 fewer people come to the UK,” the website reads.", "The UK is set to implement changes to student-dependant rules as part of a broader strategy to reduce the high number of migrants and combat those exploiting the country's flexible immigration system.", "A startling 930% surge in dependent visas since 2019 is shown by official figures.", "According to data from the Office for National Statistics (ONS), by September 2023, 152,980 visas had been granted to dependants of students — a significant increase from 14,839 in September 2019.", "The ONS also estimated that net migration was 672,000 from June 2022 to June 2023.", "Home Secretary James Cleverly said: \"This government is delivering on its commitment to the British public to cut migration.", "\"We have set out a tough plan to rapidly bring numbers down, control our borders and prevent people from manipulating our immigration system, which will come into force throughout this year.\"", "He added that the changes will see migration \"falling rapidly by the tens of thousands and contribute to our overall strategy to prevent 300,000 people from coming to the UK.\""]},
{"title": "Meghan Markle shouldn't expect a smooth road to freedom after her cage", "headline": "Meghan Markle has just been warned against expecting a smooth ride into freedom after escaping the gilded cage", "time": "\nWednesday, January 03, 2024 ", "author": "William Blythe Haynes", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525558_7208639_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525558-meghan-markle-shouldnt-expect-a-smooth-road-to-freedom-after-her-cage", "description": ["Meghan Markle has just been warned against having expectations of a ‘smooth road to success’ after getting out of her gilded cage of royal responsibilities.", "Claims like this have been shared by royal expert Tessa Dunlop.", "She weighed in on things during one of her most recent interviews with The Mirror.", "During the course of that chat she touched base on the couple’s future, and the possible trajectory of their life in 2024.", "This comes after a report by The Hollywood Reporter claimed that Hollywood views the Sussexes as “2023’s losers.”", "She was also quoted saying, “It has delighted naysayers and critics of the Duke and Duchess of Sussex that American showbiz bible, The Hollywood Reporter, cited the couple on their list of 2023's losers.”", "And “Here was proof that even Harry and Meghan's Californian colleagues had grown fed up with a couple called out for being whiny and hypocritical.”", "“But how many of us double-checked exactly what the original article said?” she also quizzed during her conversation.", "“Sure, the Sussexes are labelled 'losers', but the Hollywood Reporter concedes all the 'scorn and mockery' heaped upon them beats 'having to attend 200-plus official royal family engagements year, which sounds hellish'.”", "“In other words, Harry and Meghan might be in the celebrity doldrums right now but it is better than the performative gilded cage they left behind.”", "Before concluding she also said, “The road to freedom was never going to be smooth and the company they kept on that Hollywood list of losers, including the Marvel brand and Disney, suggests that even making the list was something of a compliment.\""]},
{"title": "Indian Supreme Court declines new inquiry against Gautam Adani", "headline": "After court's ruling, Adani, who always denied any wrongdoing said that \"truth had prevailed\"", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525576_7468752_updates.jpg", "category": "Business", "URL": "https://www.geo.tv/latest/525576-indian-supreme-court-declines-new-inquiry-against-gautam-adani", "description": ["The Supreme Court of India has recently denied requests for a new panel to be formed to investigate fraud allegations made by a US investment research firm against the businesses owned by billionaire Gautam Adani.", "According to the BBC, Hindenburg Research accused Adani's firm of \"brazen\" stock manipulation and accounting fraud in January of last year, prompting a court committee to oversee an investigation by India's market regulator in March.", "However, the panel stated in May that it had \"drawn a blank,\" and the Indian top court has requested the regulator to complete its investigation within three months.", "In response to the ruling, Adani, who has always denied any wrongdoing and called the report \"malicious,\" said that \"truth had prevailed.\"", "Petitioners claimed that certain members of the court-appointed panel looking into the claims had a \"conflict of interest\" and that the Securities and Exchange Board of India (Sebi), India's market watchdog, was not carrying out its mandate appropriately.", "Chief Justice Dhananjaya Yeshwant Chandrachud rejected their appeal, stating that there were \"no grounds\" to move the probe to a special panel and ordering Sebi to finish it as soon as possible.", "\"The power to transfer investigation must be exercised in exceptional circumstances. Such powers cannot be exercised in the absence of cogent justifications,\" he said.", "The court-appointed panel's members were not found to have a conflict of interest, and newspaper reports and third-party investigations cannot be used as conclusive evidence to challenge Sebi's finding, he added.", "Hindenburg accused Adani of \"pulling the largest con in corporate history\" by owning companies in offshore tax havens like Mauritius and the Caribbean.", "The report also claimed Adani companies had \"substantial debt\", putting the entire group on a \"precarious financial footing.\"", "The allegations against Adani Group led to a market meltdown in India, with over $100 billion in market value wiped off their companies. However, their stocks have since rebounded and experienced a price increase before Wednesday's verdict."]},
{"title": "SC issues notices to top Punjab officials on PTI's plea seeking level-playing field", "headline": "PTI submits documents containing evidence of alleged denial of level-playing field", "time": "\nWednesday, January 03, 2024 ", "author": "Maryam Nawaz", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525557_6127398_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525557-sc-to-hear-pti-plea-seeking-level-playing-field-ahead-of-elections-today", "description": [" ", "ISLAMABAD: The Supreme Court on Wednesday issued notices to the Punjab Inspector General of Police (IGP), chief secretary and advocate general on  Pakistan Tehreek-e-Insaf (PTI) petition seeking level-playing field ahead of the February 8 general elections.", "A three-member bench led by Chief Justice of Pakistan (CJP) Qazi Faez Isa and comprising Justice Muhammad Ali Mazhar and Justice Musrat Hilali heard the matter and adjourned the hearing of the case till January 8.", "The proceedings of the case were broadcast live on SC's website and YouTube channel.", "PTI lawyer Latif Khosa presented arguments on behalf of Advocate Shoaib Shaheen, who filed the appeal in the court.", "On December 22, the top court directed the ECP to address the PTI’s concerns regarding the level-playing field on the former ruling party’s petition.", "In line with the court’s order, the ECP representatives met the PTI delegation and assured them of addressing its grievances in the lead up to the February 8 national vote.", "However, the party filed another petition on December 26, seeking contempt of court proceedings against the ECP over the electoral body's alleged failure to ensure a level-playing field.", "In its petition, it lamented the electoral body's failure to implement the apex court's directions — despite being notified by the Punjab ECP — wherein it had ordered the poll organising authority to address the PTI's concerns.", "The application referred to the top court's ruling, in response to the PTI's earlier petition filed under Article 184(3) of the Constitution complaining of being denied equal opportunities in the political arena, where it directed the electoral body to meet with the party's representatives and address its relevant concerns.", "The party, in its recent application, contends that the ECP secretary failed to abide by the apex court's December 22 verdict as PTI candidates continued to be harassed and arrested even after the top court's ruling.", "Furthermore, the plea — which mentions the ECP and interior secretaries as parties to the case along with the Inspector General Police (IGPs) of all four provinces — also levels serious allegations against the Punjab IG, labelling him as the \"mastermind\" behind the crackdown against the PTI.", "Seeking action against those responsible for violating the court's order, the party had prayed to the court to ensure that its candidates are allowed to hold rallies and political gatherings.", "At the outset of the hearing, CJP Isa reprimanded Khosa for using the Sardar title with his name. ", "“Stop using words like Sardar, Nawab and Peer,” the CJP said while expressing displeasure over the use of such a title. ", "CJP Isa asked Khosa to show evidence that the ECP had violated the court's direction regarding the redressal of PTI's level-playing field grievances.", "\"I have brought the CD containing all evidence,\" Khosa replied adding that the PTI leaders were not allowed to submit their nomination papers.", " \"The entire Pakistan has seen what is happening with PTI.\" ", "At this, the CJP advised the PTI counsel against making \"political speech\" in the courtroom and asked him to only talk about the Constitution and law.", "The CJP inquired whether the petition was accusing of the IG and the chief secretary behind the actions against the PTI leader. ", "\"What does the IG and the chief secretary have to do with the election?\" the CJP wondered.", "\"Do you want action against individuals or the Election Commission?\" the CJP asked.", "Khosa replied that it was the responsibility of the Election Commission to conduct transparent elections. ", "\"Of course, we are saying that it is the responsibility of the Election Commission. You are seeking contempt of court against IGs and the chief secretary,\" the CJP said in response.", "Justice Mahar inquired how many nomination papers of PTI candidates were approved from national and provincial assembly seats.", "\"You [Khosa] are only telling the rejection of the nomination papers, also tell about the approval,\" he added.", "\"Do you want the Supreme Court to play the role of Election Commission?\" the CJP asked after Khosa complained about rejection of PTI candidates’ nomination papers by the returning officers.", "Khosa said the nomination papers of only one political party are being rejected. At which, the CJP expressed displeasure saying: \"We should turn a mic towards you so that you can make a political speech.\" ", "The CJP asked the PTI counsel to approach the appellate tribunals formed in all high courts of the country for redressal of their complaints.", "\"We have repeatedly stated that the courts stand behind every political party for democracy and elections,” the CJP said.", "Khosa asked the chief justice to play the video submitted by him to see how his party is being victimised.", "\"How can anyone turn a blind eye to the worst situation prevailing in the country,\" the PTI counsel said pointing towards allegations about denial of level-playing field.", "After the conclusion of his arguments, the apex court issued notices to the top Punjab officials and adjourned the hearing till January 8.", "Ahead of the hearing today, the PTI submitted additional documents containing evidence of the alleged denial of level-playing field to the top court.", "In the documents, the SC was informed that the nomination papers of as many as 668 PTI candidates were rejected by returning officers appointed by the ECP.", "As many as 56 incidents of nomination papers' snatching took place while seconders and proposers of the PTI were arrested in different parts of the country, the party said in the documents."]},
{"title": "Princess Mary to replace hairdresser after 23 years as she is set to become Queen", "headline": "Princess Mary of Denmark will become queen following surprise abdication of Queen Margrethe II ", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525562_6186360_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525562-princess-mary-to-replace-hairdresser-after-23-years-as-she-is-set-to-become-queen", "description": ["Princess Mary of Denmark will replace her hairdresser after 23 years as she is set to become queen following surprise abdication of Queen Margrethe II.", "Princess Mary’s hairdresser Soren Hedegaard has made an important announcement after Queen Margrethe announced she was stepping down as monarch.", "Taking to Instagram, Soren announced, “Dear Friends, with the end of 2023 and with a change of throne in view, I have also chosen a change in my life.", "“On 14/1 2024 and after 23 years as HKH Crown Princess Mary’s Hairdresser, I pass on the baton to the next generation.”", "He further said, “It's been 23 amazing and unforgettable years of memories and friendships I'll always carry in my heart.", "“My life has always been colorful and changeable and hopefully will continue to be in the years to come.”"]},
{"title": "ECP indicts Imran Khan, Fawad Chaudhry in contempt case", "headline": "Four-member bench of electoral body conducts hearing of the case in Adiala jail", "time": "\nWednesday, January 03, 2024 ", "author": "Shabbir Dar", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525581_136994_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525581-ecp-indicts-imran-khan-fawad-chaudhry-in-contempt-case", "description": ["RAWALPINDI: The Election Commission of Pakistan (ECP) on Wednesday indicted Pakistan Tehreek-e-Insaf (PTI) founder Imran Khan and former information minister Fawad Chaudhry in a case of contempt against the electoral body and the chief election commissioner.", "A four-member bench of the electoral body, headed by Sindh Member Nisar Ahmad Durrani, conducted the hearing of the case in Adiala jail, where both the leaders are incarcerated. ", "The former prime minister and ex-minister were present in the courtroom during the hearing and denied the allegations mentioned in the charge sheet. ", "The ECP then adjourned the hearing on the contempt case till January 16.", "The electoral body had initiated contempt proceedings against the former PTI chairman, former party leader Asad Umar and Fawad for insulting the commission and its chief during various public meetings, press conferences and several interviews.", "According to the notice, politicos face the charges of passing unparliamentary, intemperate, and contemptuous remarks against the ECP on various occasions.", "The political leaders were asked to either personally appear before the commission bench to clear their position or through their counsel.", "Instead of appearing before the bench, they challenged the commission’s jurisdiction in several high courts. However, the Supreme Court in January 2023 allowed the commission to initiate proceedings against them and on June 21, the ECP decided to frame charges against them which was yet to be done. ", "As per a copy of the charge sheet available with ", ", the PTI founder and former minister launched a contemptuous campaign against the ECP under a plan in 2022. ", "\"The accused used non-parliamentary language against the ECP in a public gathering in Bhakkar on July 12, 2022,\" it stated while mentioning a few other similar instances. ", "The charge sheet further stated that the accused committed contempt against ECP under the Election Act 2017 and the electoral body has the jurisdiction to take action against the accused as per Supreme Court's observation. ", "The prosecution, in the sheet, called for initiation of a trial against the accused in the light of evidences, videos and documents.", "During the previous hearing on December 27, the electoral watchdog could not charge the PTI founder and ex-information minister. ", "The hearing and the charge sheeting of the two were adjourned until January 3 (today). ", "PTI leader Asghar Chaudhry, while speaking to media persons outside Adiala jail, said such an Election Commission was never seen even during the martial law era. ", "\"You rejected the nomination papers of the candidates and took away the papers from them. Even cruelty has an end,\" he lamented."]},
{"title": "Is Kanye West behind 'vulnerable' Bianca Censori's choices?", "headline": "After Kanye West shared explicit images of wife Bianca Censori, a body language expert weighed in on the controversy", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525578_6363666_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525578-is-kanye-west-behind-vulnerable-bianca-censoris-choices", "description": ["After Kanye West broke the Internet with Bianca Censori’s explicit images, a body language expert weighed in on the controversy.", "The opinion comes after the Canadian rapper took to his Instagram account and shared a string of pictures featuring Bianca wearing either a thong or string bikini. ", "After observing the images, an expert named Judi James told the ", "that Kanye is attempting to \"show off his power\" in the marriage.", "Judi James told the outlet: \"While Kanye was trailing his beautiful new bride clad only in a flesh-coloured body suit, the hope was that this publicity stunt was some kind of shared joke between the couple.”", "However, according to the expert, the new photos suggest that what goes on in their private life seems “more extreme” than their public one.", "\"Kanye might be showing us his wife looking blankly unhappy as she stands encased in a random-looking set of strips of fabric and fur but it’s his own body language that creates the real impact here,” she said.", "Judi assessed Bianca’s wardrobe choice and claimed that she looks “vulnerable.”", "“She is dressed in perhaps the most daring 'outfits' to date and looks vulnerable with at least one facial expression suggesting uncertainty or nervousness but he [Kanye] just looks into the screen like one of his fans filming him onstage at a live concert might do,” she concluded."]},
{"title": "Camila Cabello praises Selena Gomez on social media", "headline": "Previously, Selena Gomez interview Camila Cabello for the launch of a mental health website", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525586_1594829_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525586-camila-cabello-praises-selena-gomez-on-social-media", "description": ["Camila Cabello shows off her love for Selena Gomez in a new social media post.", "The pair, who are also members of Taylor Swift's A-list celebrity squad, have bonded over mental health issues in the past and share a warm friendship.", "Taking to her Instagram stories, the ", "crooner posted a sweet picture of herself hugging the Rare Beauty mogul and penned: “The realest, baddest, loveliest.”", "With no current collaborations in hindsight, Camila and Selena have occasionally sparked rumors that they may work together on music.", "The ", "crooner, who has experienced personal psychological issues in the past, once interviewed Camila for the 2022 launch of the ", "website.", "The 26 year-old singer opened up about her mental health and revealed that her “anxiety manifests as obsessive-compulsive stuff.”", "Camila elaborated: “It can look like asking the same question, like: ‘What did you mean by that? Are you sure you’re not mad at me? Wait, are you sure you’re not mad at me?’ and doing that over and over.”", "She added, “It used to happen so much more, getting stuck in these loops for a long time to the point where I felt like I could not get an answer I was satisfied with, so I would be obsessively going down this loop.”"]},
{"title": "Jimmy Kimmel rebukes Aaron Rodgers' 'dangerous' accusation", "headline": "Jimmy Kimmel's fury comes after Aaron Rodgers accused him of being Jeffery Epstein's client", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525580-jimmy-kimmel-rebukes-aaron-rodgers-dangerous-accusation", "description": ["Jimmy Kimmel is currently threatening Aaron Rodgers with a lawsuit for making strong claims against him.", "The 56 year-old host’s fury comes after the quarterback was discussing the impending list of Jefferey Epstein’s clients, the financier who died by suicide as he awaited trial on federal conspiracy and sex trafficking charges. ", "The New York Jets star stated: “A lot of people, including Jimmy Kimmel, are hoping that [list] doesn’t come out.”", "His comment comes after the assumption that many high-profile personalities are rumored to be on the list.", "“I’ll tell you what, if it comes out, I definitely will be popping some sort of bottle,” Aaron continued in the interview clip that went viral on social media.", "Retweeting the video, Jimmy cussed the footballer and penned: “Dear Aa******, for the record, I’ve not met, flown with, visited, or had any contact whatsoever with Epstein.”", "Threatening Aaron with a lawsuit, the ", "headliner", "added: “Nor will you find my name on any ‘list’ other than the clearly-phony nonsense that soft-brained wackos like yourself can’t seem to distinguish from reality. Your reckless words put my family in danger. Keep it up and we will debate the facts further in court.\""]},
{"title": "Ben Affleck, Jennifer Lopez quash marital trouble rumours with steamy PDA", "headline": "Ben Affleck and Jennifer Lopez were recently spotted arguing at St. Barts amid new year celebrations\n", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525592-ben-affleck-jennifer-lopez-quash-marital-trouble-rumours-with-steamy-pda", "description": ["Ben Affleck and Jennifer Lopez dismissed rumours of a troubled marriage as they were spotted locking lips while enjoying vacation in the Caribbean.", "The duo was first spotted arguing while looking at pricey Bulgari jewelry after sharing a tense car ride in St. Barts. However, they later seemed to have made up with a kiss. ", "In picture obtained by ", "Affleck could be seen resting his hands on JLo’s shoulder as they shared the intimate moment. ", "Meanwhile, it has been predicted that Lopez’s marriage with Affleck would be tested this year as the duo might grow apart after engaging in “petty arguments” and “disagreements.”", "In a conversation with ", " Inbaal Honigman said Lopez and Affleck will have to deal with fresh waves of issues before they approach their second wedding anniversary.", "Honigman said their romantic life \"will go through ups and downs together,” adding, “15 August - 28 August, are uneasy for the fiery pair, and they engage in misunderstandings and petty arguments.”"]},
{"title": "Jin of BTS releases pre-recorded New Year's message", "headline": "Jin was the first member of BTS to enlist in the South Korean military", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525584-jin-of-bts-releases-pre-recorded-new-years-message", "description": ["Jin of BTS surprised his ARMY fandom with a pre-recorded video as the K-pop idol is currently serving in the South Korean military.", "With just a few months remaining to complete his mandatory service, the 31-year-old singer took to the boy band’s official Youtube page and wished his fans a happy new year. ", "He opened the message with heartfelt greetings and said: “It’s January, everyone. The new year has come. I will become a year older in January. I’d be in my mid-30s by now,\" he referred to his birth date i.e. December 4.", "Jin, who was the first member of BTS to enlist in the military, also joked about the nature of his own video and said: “Did you all make a snowman? I’m still in the past so I don’t know if it’s snowing or not, but if it snows, you have to make a snowman.”", "The singer reiterated that he had pre-filmed the video and said that he wanted to make sure he could provide fans with an update on his life as they wait for him to complete his military service, which he had already put off for years.", "“I’m leaving this video so you can watch my pretty, handsome face and spend January and February warmly. I miss you all. I miss you a lot,” he concluded."]},
{"title": "Meghan Markle, Prince Harry warned amid rumours Duchess is writing her own memoir", "headline": "Meghan Markle was 'humiliated’ and left red-faced after the publishers demanded she must submit draft of her memoir before payment", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525554_3025910_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525554-meghan-markle-prince-harry-warned-amid-rumours-duchess-is-writing-her-own-memoir", "description": ["Meghan Markle and Prince Harry have been warned amid reports the Duchess of Sussex was writing her own memoir after the success of Harry’s bombshell tell-all ", "Royal expert and major critic of the couple, Angela Levin has warned that if Meghan writes her memoir it would be less likely she and Harry would be invited to the UK and that people could be even more 'fed up' with her.", "Taking to X, formerly Twitter, the royal author tweeted, “Will Meghan really write her memoir. If it's full of moans and recollections that may vary, people could be even more fed up with her.”", "She went on to say, “There could be more cartoons and be less likely she and Harry would be invited to the UK. What will Harry do?”", "Angela’s warning came after claims Meghan Markle was ‘humiliated’ and left red-faced after the publishers demanded she must submit her memoir's draft before payment."]},
{"title": "King Charles strategy about 'line of succession' amid calls for abdication laid bare", "headline": "King Charles is facing growing calls to abdicate after Denmark's Queen Margrethe II said she would abdicate on January 14 ", "time": "\nWednesday, January 03, 2024 ", "author": "William Blythe Haynes", "feature_img": null, "category": "Entertainment", "URL": "https://www.geo.tv/latest/525582-king-charles-strategy-about-line-of-succession-amid-calls-for-abdication-laid-bare", "description": ["Britain’s King Charles wants to concentrate on the direct line of succession, from him to Prince William and then Prince George amid growing calls for his abdication.", "This has been claimed by royal expert Michael Cole in conversation with the ", "Cole told the publication that he believes King Charles will continue with his strategy, trusting Prince William and ‘beloved daughter-in-law’ Kate Middleton to play a leading role in the Firm.", "He said, “King Charles wants to concentrate on the direct line of succession, from him to Prince William and then Prince George, Princess Charlotte and Prince Louis. That is how he wants it.”", "Commenting on rumours that Princess Beatrice and Eugenie would become working royals, Cole said it was difficult to see major roles for Prince Andrew's daughters.", "He said, “That is not because they are not willing, they are nice people and good ambassadors for this country.", "\"But the King deliberately wants to concentrate on the main line of succession.”", "\"If that means there will be fewer royal appearances around the country and the Commonwealth then so be it.\"", "The royal expert’s remarks came as King Charles is facing the growing calls to abdicate after Denmark´s popular Queen Margrethe II, Europe´s longest-serving monarch, said Sunday that she would abdicate on January 14 and pass the baton to her son Crown Prince Frederik."]},
{"title": "I fear getting sick and dying. Help me please!", "headline": "\"My mind always wanders towards the worst-case scenario and I'm not sure how to get rid of these thoughts\"", "time": "\nWednesday, January 03, 2024 ", "author": "Haya Malik", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525550_4858849_updates.jpg", "category": "Health", "URL": "https://www.geo.tv/latest/525550-i-fear-getting-sick-and-dying-help-me-please", "description": ["Hi Haya,", "I'm really afraid of getting sick and dying. I don't know why, but this feeling has kept me anxious all my life. I'm in my late 20s and these thoughts just won't go away.", "I'm living a normal life otherwise, but it's sometimes really difficult to deal with these thoughts. I would get scared and panic even if I had a mild headache.", "When I was younger I'd read up on different illnesses on websites and ever since then my mind always wanders towards the worst-case scenario. I'm not sure how to get rid of these thoughts.", "Please help!", "Fear and anxiety are emotions that keep us stuck and prevent us from moving forward into the life we have the potential to live and be. ", "As a psychotherapist, I would address your concerns with curiosity, empathy and understanding. It sounds like you are having health anxiety. ", "Here are some avenues I would consider worth exploring: ", "Understand the root of your anxiety. It sounds like your childhood fears and traumas have a part to play in you feeling this way. It will be helpful to explore past traumas that may have contributed to these fears. Understanding the underlying causes can be a crucial step in managing your anxiety. ", "We can’t get rid of thoughts — what you resist persists. The more you force a thought to be pushed away the more it will stay. Instead, I would invite you to look at your thoughts with curiosity, compassion, and an action plan to work through them. ", "For this, I would first recommend Cognitive Behavioral therapy (CBT), a well-established therapeutic approach for managing anxiety, including health anxiety. It focuses on identifying and challenging negative thought patterns. In your case, a therapist might help you recognise and reframe catastrophic thoughts related to illness and death. By altering these thought patterns, you can work towards reducing anxiety and creating more balanced and realistic perspectives. ", "Secondly, you may, together with your therapist, work towards gradual exposure. This might involve gradually confronting and tolerating health-related triggers, such as experiencing mild physical sensations without immediately interpreting them as signs of a serious illness.", "Thirdly, I would encourage you to explore mindfulness and relaxation techniques. Mindfulness practices, such as meditation and deep breathing, can help you become more aware of the present moment and manage anxious thoughts. Learning to ground yourself in the here and now can be particularly beneficial for individuals struggling with fears and anxious thoughts. ", "Fourth, limit online searches. Excessive online searches can fuel anxiety. ", "Fifth, I would encourage you to develop coping strategies, you will need to find what works for you. this might include creating a structured plan for managing anxious thoughts, engaging in activities that bring a sense of joy or relaxation, and building a support system.", "I would also encourage you to assess various aspects of your life, including relationships, work, and lifestyle, which are crucial. Sometimes, addressing stressors in these areas can have a positive impact on overall well-being and may contribute to a reduction in health-related anxiety.", "Hope this helps!"]},
{"title": "WATCH: Hungry hawk swoops on little kitten — Will it eat it?", "headline": "Remarkable encounter between two very different creatures reminds of unpredictability of nature", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": null, "category": "Amazing", "URL": "https://www.geo.tv/latest/525591-watch-hungry-hawk-swoops-on-little-kitten-will-it-eat-it", "description": ["Nature is full of surprises, and sometimes it offers us glimpses into the delicate balance between predator and prey but a recent extraordinary incident caught on camera, showcases the raw beauty of the animal kingdom.", "In an unexpected encounter, a hawk attempted to hunt down a kitten through a car windshield as the driver watched in amazement.", "The hawk swooped down onto the hood of the car, its sharp eyes fixed on the oblivious kitten perched on the dashboard but it did not expect what would follow.", "Instead of attacking the kitten, the dumbfounded hawk simply perched on the hood and looked around for a few moments before accepting defeat and flying away.", "It was a remarkable and unusual interaction between two very different creatures and a reminder of the unpredictability of nature.", "The video quickly became viral on social media as reactions came pouring in from across the world.", "Comments on Instagram ranged from hilarious to concerned.", "One of them said, \"Poor cat scared as hell. All for a video.\"", "Another netizen wrote, \"I would turn the windshield wiper on.\"", "A third said, \"good thing the baby kitten was inside.\""]},
{"title": "CJP asks govt to give in writing that there'll be no more enforced disappearances", "headline": "State needs to change its mindset as court verdicts alone are not enough to end such practices, says CJP Isa", "time": "\nWednesday, January 03, 2024 ", "author": "Maryam Nawaz", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525590_4956091_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525590-cjp-asks-govt-to-give-in-writing-that-therell-be-no-more-enforced-disappearances", "description": ["ISLAMABAD: Chief Justice of Pakistan (CJP) Qazi Faez Isa on Wednesday asked the federal government to give in writing that there would be no more enforced disappearances in the country.", "The development came as a three-member bench led by Justice Isa and comprising Justice Muhammad Ali Mazhar and Justice Musarrat Hilali, heard the petition of Barrister Aitzaz Ahsan and other petitioners on the unlawful practice of enforced disappearances, praying for declaring it as violative of various articles of the Constitution.", "“We do not want a statement from any section officer. The Government of Pakistan should give us in writing that no one will be illegally disappeared anymore,” the CJP said during a hearing of the case.", "Aitzaz had prayed the court to declare that enforced disappearances are violative of Articles 4, 9, 10, 14, 19, and 25 of the Constitution besides declaring that the Commission of Inquiry on Enforced Disappearances does not adequately comply with legal and international standards.", "Similarly, he asked the apex court to set up an effective and purposeful commission.", "He prayed the apex court that the commission should be headed by a judge of the Supreme Court while members of the commission should be the Supreme Court Bar Association president, Pakistan Bar Council vice chairman, Lahore, Sindh, Peshawar, Quetta Bar Association heads, Human Rights Commission of Pakistan chairman, National Commission on Status of Women chairperson, Inter-Services Intelligence (ISI) Director General, Intelligence Bureau (IB) additional director general and Pakistan Federal Union of Journalists president.", "In today's hearing, the CJP lamented that the country has been “fractured” by its people, saying that the state needs to change its mindset as court verdicts alone are not enough to end the practice of enforced disappearance.", "At the outset of the hearing, Ahsan’s counsel Shoaib Shaheen cited the Supreme Court’s verdict on the 2017 Faziabad sit-in. ", "The CJP inquired how the Faizabad sit-in verdict is related to enforced disappearances. Advocate Shaheen maintained that the court has mentioned the role of intelligence agencies in the verdict.", "At this, the CJP asked Shaheen to explain the part of the Faizabad sit-in decision that applied to the participants of the Baloch protesters protesting against enforced disappearances.", "The counsel replied that the Faizabad verdict stated that peaceful protest is the right of every citizen and called for action against those who resorted to violence.", "“I am surprised that you are referring to the Faizabad ", "verdict,” the CJP remarked.", "Advocate Shaheen said he had been always referring to the Faizabad verdict. “If the Faizabad sit-in decision had been followed so such circumstances would not have happened today,” he added.", "The top court adjourned the hearing of the case till January 9."]},
{"title": "Prince William fails to protect Kate Middleton ", "headline": "Kate Middleton was recently dragged after she was named as one of the two racist royals by Omid Scobie in ‘Endgame’", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525595_7682962_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525595-prince-william-fails-to-protect-kate-middleton", "description": ["Prince William reportedly feels “guilty” for not being able to protect his wife, Kate Middleton, from public attacks launched at her by Meghan Markle’s “mouth-piece,” Omid Scobie. ", "William, the Prince of Wales, believes he could not keep up the promise he made to Kate’s parents, Michael and Carole Middleton, that he would always look after the Princess. ", "Speaking with", "royal expert Jennie Bond said William is suffering in silence since Scobie accidently named Kate as one of the two “racist royals” who had concerns about Prince Archie’s skin colour. ", "He hates the pressure Kate Middleton is in, the expert told the publication, adding, \"William feels guilty and angry because he promised Kate’s parents that he would protect and look after her.”", "The expert continued: \"The attacks from Omid Scobie were vicious, so William will feel guilty because all she’s done is fall in love with someone who happened to be a future king.", "\"There’s obviously a lot of baggage that comes with this – it’s a unique and different life which you’ve got to have a very thick skin for.\"", "She went on to add how proud William feels seeing her thrive as the Princess of Wales following the tragic passing of his grandmother, Queen Elizabeth.", "\"Kate has demonstrated that she's the real deal and William constantly shows that he's hugely proud of her,” Bond shared. ", "“Kate's strength is drawn from the fact that she was given such a long apprenticeship - those nine or ten years that she was allowed to see a little bit of what life would be like in the royal court were completely invaluable.\""]},
{"title": "Psychic speaks out about Meghan Markle, Prince Harry's future as couple", "headline": "Prince Harry and Meghan Markle's reconciliation with royal family has also been ruled out", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525598_4210511_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525598-psychic-speaks-out-about-meghan-markle-prince-harrys-future-as-couple", "description": ["A celebrity psychic has opened about Meghan Markle and Prince Harry's future as husband and wife, saying they will remain ‘strong as a couple’.", "Speaking to ", " magazine, per ", ", psychic Sally Morgan said, \"They will remain strong as a couple and likely move house next year, although I don't see them leaving the United States, or even California, which they've worked hard to make feel like home.\"", "She also dismissed claims that Meghan and Harry may relocate to the UK, saying: “England is out of the question, but they will also buy a holiday home in Canada, which they’ll use in the winter months for skiing.\"", "About reconciliation with the royal family, the psychic predicted there is absolutely ‘no chance’ of them reconciling with the Royal Family for years."]},
{"title": "Michael Jackson's mother seeks legal compensation from his estate", "headline": "Before his death, Michael Jackson set up a trust fund for his mother Katherine Jackson", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525593_5453249_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525593-michael-jacksons-mother-seeks-legal-compensation-from-his-estate", "description": ["Michael Jackson's mother Katherine Jackson recently requested the court to order the estate to compensate her for the legal expenses she incurred the legal battle with executors over a proposed settlement.", "According to ", ", the 93-year-old woman claimed that she was charged $561,548 by the legal firm Glaser Weil Fink Howard Jordan & Shapiro (Glasser Weil) for the services.", "To look after his mother, Michael had already established a trust called The Katherine Jackson Trust. Moreover, he had named John McClain and John Branca as executors of his estate who now assert that they turned it around by making hundreds of millions of dollars.", "Recently, Branca and McClain requested the court to approve a confidential bargain involving Michael's recordings which was opposed by Katherine. ", "The judge dismissed her protest and allowed the pair to move forward with the sale.", "Katherine challenged the ruling a few days later, requesting that a higher court take a closer look at the case. Additionally, she filed a second application for attorney fees.", "She claimed that in addition to interviewing family members, her law company also had to collect paperwork, prepare trial exhibits, draft trial papers, prepare witnesses, question and cross-examine witnesses, and perform other duties."]},
{"title": "Election 2024: PTI to now play without 'bat'", "headline": "Peshawar High Court restores Election Commission of Pakistan's order, stripping PTI of 'bat' electoral symbol ", "time": "\nWednesday, January 03, 2024 ", "author": "Daniyal Aziz", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525553_9851927_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525553-pti-bat-symbol-case-phc-resumes-hearing-on-ecp-plea", "description": ["PESHAWAR: The Peshawar High Court (PHC) on Wednesday revoked the stay order granted by its single-member bench, restoring the Election Commission of Pakistan's (ECP) decision to declare PTI intra-party polls null and void and stripping it of its election symbol — bat. ", "A single-member bench comprising Justice Ejaz Khan announced the verdict that the court had reserved hours earlier.", "Election commission's lawyer Sikander Bashir Mohmand and PTI's legal team — comprising Advocates Shah Faisal Uthmankhel and Qazi Anwar — appeared in the courtroom. ", "In its six-page order, the PHC noted that its earlier verdict had “prima facie created hindrance in the smooth process of the election which Is to be conducted by the ECP”.", "“...the interim order of this court passed in favour of the PTI is hereby recalled and consequently the Election Commission of Pakistan is directed to proceed with the election process as per its constitutional mandate.”", "The party’s candidates would now, given the order, have to contest elections “independently”, Ahmed Bilal Mehboob, chief of the think tank Pildat, told ", ".", "The electoral body had filed a review petition at the high court against the PHC's December 26 decision, which had suspended the ECP's order and restored the party's 'bat' symbol till a final decision on the matter.", "The ECP, in its order on December 22, had declared PTI's intra-party polls \"illegal\" and stripped it of using the 'bat' symbol. ", "Following its order, the former ruling party approached the PHC, seeking to restore its electoral symbol ahead of the general elections slated for February 8, as it is a major voter driving force.", "In its petition, the ECP requested the court review the PTI's intra-party elections and its decision related to the election symbol.", "Barrister Asad Rahim Khan told ", " that following the setback in the PHC, the party can still knock on the doors of the Supreme Court of Pakistan.", "\"[However, PTI] also has a division bench hearing in the PHC on the 9th. Depending on that decision, it can then go to the Supreme Court,\" the legal expert added.", "Talking to reporters in Rawalpindi, PTI's former chairman Barrister Gohar Khan said his party would move the apex court after due deliberations, noting that the SC \"would not let this matter slide\".", "\"The Supreme Court has already stated that revoking a party's symbol is tantamount to disbanding the entire party,\" the PTI leader said, hoping that his party would get relief from the top court.", "Gohar noted that all PTI ticket holders would run as independent candidates if the apex court did not accept the party's plea, however, he said today's decision has \"damaged\" democracy.", "\"If the election commissions has an issue with the 'bat', then it can allot us another symbol,\" he urged.", "At the outset of the hearing, Advocate Anwar said that he, along with Barrister Gohar Khan, will represent the PTI in this case.", "\"The political parties, in the court, said that they stand with the Election Commission,\" said Anwar. ", "At this, Justice Khan said: \"We have learned from you that these things are baseless in the eyes of law as whatever happens outside the court has nothing to do with the hearing\". ", "\"Can the ECP approach the court against the high court's ruling?\" questioned PTI's lawyer calling the electoral body’s petition incorrect.", "Advocate Anwar said that the PHC announced its verdict on December 26, however, it has not yet been implemented. \"Election Commission has not yet issued the [PTI] intra-party election certificate on the website,\" he added. ", "\"Did your party file any contempt case in this matter?\" asked Justice Khan.", "Following this, the PTI's counsel said that sidelining a party was not good for the ECP or the democracy.", "He said that the PTI wants the ECP to conduct free and fair elections.", "Advocate Anwar then inquired about the electoral body's authority to challenge a high court order. ", "Later, the ECP's counsel told the court that the body was not removing any political party from the list but required the parties to follow its laws.", "Mohmand said that the PTI did not conduct intra-party polls, hence, the party elections have been declared null and void. He requested the court to withdraw the PTI's stay order. ", "The court then reserved the verdict after hearing arguments from both sides. "]},
{"title": "Costa Rica's 'hooker's lips' faces kiss of extinction — Here's why", "headline": "Psychotria elata or hooker lips plant is given as sign of affection to loved ones in Central America", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525599_7576433_updates.jpg", "category": "World", "URL": "https://www.geo.tv/latest/525599-costa-ricas-hooker-lips-plant-meets-threat-of-extinction", "description": ["Psychotria elata is a stunning botanical wonder of the tropical flora known as the \"hot lips plant\" or \"hooker's lips plant,\" that is indigenous to the rainforests of Costa Rica, Ecuador, and many other Central and South American nations.", "What makes this plant special are its leaves, which resemble bracts. These bracts have two lips that mimic human lips. This eye-catching characteristic attracts pollinators such as hummingbirds and butterflies.", "The bracts' vibrant colour and juicy texture give them the appearance of ripe fruit. This attracts pollinators, including hummingbirds and butterflies, to them. As they explore, maybe they'll transfer pollen from bloom to bloom. Though they are star-shaped and tiny, the real blooms do not draw as much attention as the striking bracts.", "More notable than the plant's blossom, according to the ", ", are the bracts, which are white and fragrant and usually emerge from the core of the \"red hot\" bracts between December and March. ", "The plant is given as a sign of affection to loved ones in Central America, especially on Valentine's Day. Its bark and leaves are also used by the locals to treat a range of ailments, including skin irritation.", "Unfortunately, the steady death of the plant can be attributed to both climate change and deforestation. Therefore, it is essential that additional care and protection be provided in order to maintain the life of this endangered species and prevent us from having to say goodbye to it."]},
{"title": "Sharmeen Obaid Chinoy talks about her upcoming 'Star Wars' film", "headline": "Sharmeen Obaid Chinoy is the first female director to shoot a 'Star Wars' film", "time": "\nWednesday, January 03, 2024 ", "author": "Melanie Walker", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525597_7965765_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525597-sharmeen-obaid-chinoy-talks-about-her-upcoming-star-wars-film", "description": ["Sharmeen Obaid Chinoy is all set to become the first female director of the Star Wars franchise.", "The 45 year-old Pakistani-Canadian director is also the first woman of color to shoot the next part ", "of the sci-fi installation.", "Set to begin filming this year, Sharmeen spoke to ", "on New Year’s Eve and said: “I'm very thrilled about the project because I feel what we're about to create is something very special.”", "She added: “We're in 2024 now, and it's about time that we had a woman come forward to shape a story in a galaxy far, far away.”", "The Academy Award winner also shared that the film has been written by ", " creator Steven Knight and confirmed that Daisy Ridley will return to play Rey.", "Sharmeen is known among the filming community for winning an Oscar for her documentary ", "and directing two episodes of the ", "series.", "She has won seven Emmy Awards, two Academy Awards, a Knight International Journalism Award, and other honours throughout her career. "]},
{"title": "Queen Camilla not a ‘natural royal' but performs her role ‘well'", "headline": "Queen Camilla hailed for managing her royal duties well despite not being natural for the role\n", "time": "\nWednesday, January 03, 2024 ", "author": "Eloise Wells Morin", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525563_4712148_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525563-queen-camilla-not-a-natural-royal-but-performs-her-role-well", "description": ["Queen Camilla received praises for taking on her royal role “very well” despite not being a “natural” for it by her sister-in-law Princess Anne.", "Back in the day, Camilla received backlash over her affair with then-Prince Charles, who was married to late Princess Diana at the time.", "However, over the years after the two tied the knot in 2005, her reputation started to heal and she eventually became the Queen Consort after Charles ascended to the throne. ", "In ", "documentary, ", ", Anne, Princess Royal, said, \"I’ve known [Camilla] a long time off and on.”", "“Her understanding of the role and how much difference it makes to the King has been absolutely outstanding,\" she added. \"This role is not something that she’d be a natural for, but she does it really well.\"", "\"She provides that change of speed and tone, that’s equally important,\" she continued. ", "Recently, Omid Scobie dished on how Queen Elizabeth did not give her blessings to Charles and Camilla during the early period of their romance. ", "He penned in his hotly released book, ", ", \"Camilla might not have stood on the barricades in the sixties, but she did enjoy the sexual freedoms ushered in by that radical generation.”", "\"Over the years, some who knew Camilla during this time have told various authors and journalists that the young Ms. Shand was known for being 'raunchy and randy' and the sort to 'throw her knickers on the table.’", "\"This reputation is one of the reasons why Queen Elizabeth II and the Firm rejected Camilla as a spouse for Charles, alongside the fact she was a 'commoner' (the air around her family home was not rarified enough) and an 'experienced woman' (read: not a virgin),\" Scobie added."]},
{"title": "IHC stops authorities from forcing Baloch protesters to end Islamabad sit-in", "headline": "Islamabad High Court summons DC Islamabad and SSP Operations in next hearing", "time": "\nWednesday, January 03, 2024 ", "author": "Awais Yousafzai", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525601_3184246_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525601-ihc-stops-authorities-from-harassing-removing-baloch-protesters-by-force", "description": ["ISLAMABAD: The Islamabad High Court (IHC) on Wednesday stopped local authorities of the federal capital from harassing and removing Baloch protesters by force from the National Press Club.", "Justice Mohsin Akhtar Kayani issued directives to authorities in the federal capital while hearing a case pertaining to the alleged harassment and the use of force against Baloch families protesting against extra-judicial killing and enforced disappearances.", "Additionally, the high court also ordered in-person appearance of Islamabad's deputy commissioner (DC) and senior superintendent police (SSP) Operations in the next hearing on January 5.", "Justice Kayani was hearing a petition filed by a Baloch activist Sammi Deen Baloch against alleged harassment of protesting families by police.", "At the outset of the hearing, Ataullah Kundi Advocate, who appeared as Sammi’s lawyer, apprised the court that Baloch families have staged a sit-in outside the National Press Club in Islamabad. ", "The police had arrested several women and children after lodging cases before the court ordered their release, he added.", "Authorities later attempted to vacate the sit-in venue by forcing women to sit in buses, said the lawyer, adding Islamabad policemen were continuously harassing them by seizing speakers and sometimes by creating tense situations of relaunching crackdowns.", "The judge questioned whether the protesters were advancing to somewhere other than their venue. The lawyer replied that Baloch marchers were not advancing anywhere.", "The judge remarked that Shahra-e-Dastoor, in other words, Constitution Avenue has a history of hosting big demonstrations and sit-ins.", "Some people had used the same spot to stage months-long sit-ins on Shahrah-e-Dastoor and hurled abuses at the courts, he continued.", "While reprimanding the federal capital’s authorities, Justice Kayani observed that Metropolitan Corporation Islamabad (MCI) was responsible for handling the situation but the Election Commission of Pakistan (ECP) apparently had no interest in holding local government (LG) polls despite court orders.", "He added an administration was now running Islamabad’s municipal authority and no one had an interest to accept the constitutional rights of the citizens.", "Later, the IHC judge issued orders, barring authorities from harassing and removing the Baloch marchers by force besides ordering DC Islamabad and SSP Operations to ensure their personal appearance in the next hearing.", "The hearing was adjourned till January 5.", "Last month, the long march participants led by Baloch women were detained by authorities during a demonstration in Islamabad against the enforced disappearances of Baloch missing persons.", "The march began from Turbat on December 6 and reached Islamabad’s press club on December 20 when the police intercepted them.", "An advance party of Baloch Yakjehti Council (BYC) reached Islamabad through the Motorway, but the police intercepted it at Chungi No. 26 and barricaded all the main and artery roads, including Kashmir Avenue, leading to the Red Zone.", "When they arrived in the capital, cops launched a crackdown against the protesters and dismantled their camps set up outside the National Press Club.", "Most of the protesters were arrested by the police, a move that sparked anguish across the country.", "On December 21, IHC Chief Justice Aamer Farooq warned the capital city's top cop against any hindrance in the protest staged by the Baloch marchers, saying that they have the constitutional right to demonstration.", "Following the court directives, all protesters were released in phases after several rounds of talks with the caretaker government’s negotiation team."]},
{"title": "Can PTI get another symbol for general elections?", "headline": "PTI candidates will contest polls independently with different symbols, says Pildat president", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525603_3404848_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525603-can-pti-get-another-symbol-for-general-elections", "description": ["The Peshawar High Court (PHC) Wednesday revoked its earlier stay order that had suspended the Election Commission of Pakistan (ECP) ruling that stripped the Pakistan Tehreek-e-Insaf (PTI) of its bat symbol due to irregularities in its intra-party polls. ", "The development has left the former ruling party, its candidates, and supporters in limbo in the wake of the upcoming elections slated for February 8.", "PTI’s participation in the general elections faces uncertainty as it is not yet clear whether the party will be able to obtain another symbol, or will its candidates contest the polls independently on different symbols.", "Talking to ", ", Pakistan Institute of Legislative Development and Transparency (Pildat) President Ahmed Bilal Mehboob shared valuable insight on the party’s options after PHC’s single-member bench comprising Justice Ejaz Khan restored the ECP’s ruling against PTI’s intra-party polls.", "Terming the court’s earlier verdict as “defective”, Mehboob stressed that the PHC had not only ignored the jurisdiction matter but also hadn’t heard the electoral body’s counsel on the said issue.", "Lamenting that the former ruling party hastily conducted intra-party polls, the Pildat president highlighted that the PTI should have taken their due time to conduct the elections as per the rules and regulations.", "When asked about whether Imran Khan’s party can obtain another common electoral symbol — other than bat — for the upcoming polls, Mehboob said: “PTI cannot contest elections on any common electoral symbol [...] every candidate will contest the polls independently with different symbols.”", "“It would be difficult to ascertain who are PTI’s candidates,” he noted.", "However, the Pildat chief further said that the party can use its social media presence to effect use to disseminate relevant information regarding its individual candidates and their respective electoral symbols.", "Responding to a query regarding the PTI seeking another electoral symbol for the party other than the bat, Mehboob stressed that the ECP’s objection does not concern the “bat” symbol but with the fact that whether such a political party is eligible to have a common electoral symbol if it didn’t conduct its intra-party polls as per the rules and regulations.", "The party’s name can be used, however, the ballot paper only provisions the names of the candidates along with their respective symbols, Mehboob said while responding to a question about whether the PTI can even retain its name in the polls or not.", "The party’s candidates would have to contest the elections “independently”, he said.", "When asked about whether PTI can be counted out of the polls, the Pildat official said that the party has a history of bouncing back from setbacks and that it can still utilise its social media presence to effectively publicise its candidates and their symbols from relevant constituencies.", "However, the development will hurt the former ruling party, he concluded.", "Meanwhile, Barrister Asad Rahim Khan told ", " that following the setback in the PHC, the party can still knock on the doors of the Supreme Court of Pakistan.", "\"[However, PTI] also has a division bench hearing in the PHC on the 9th. Depending on that decision, it can then go to the Supreme Court,\" the legal expert added.", "The lawyer was referring to the hearing of the said case before the high court's divisional bench next week.", "Separately, talking to reporters in Rawalpindi, PTI leader Barrister Gohar  Khan said his party would move the apex court after due deliberations, noting that the SC \"would not let this matter slide\".", "\"The SC has already stated that revoking a party's symbol is tantamount to disbanding the entire party,\" the PTI leader said, hoping that his party would get relief from the top court.", "Gohar noted that all PTI ticket holders would run as independent candidates if the apex court did not accept the party's plea, however, he said today's decision has \"damaged\" democracy."]},
{"title": "Iran bombing: General Qassem Soleimani grave blasts death toll rises to 73", "headline": "Explosions ripped through ceremony marking 4th anniversary of Qassem Soleimani's assassination", "time": "\nWednesday, January 03, 2024 ", "author": null, "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525605_5621589_updates.jpg", "category": "World", "URL": "https://www.geo.tv/latest/525605-iran-bombing-twin-blasts-near-general-qassem-soleimanis-grave-kill-73", "description": ["Two bombings near the tomb of Iranian Revolutionary Guards general Qasem Soleimani on the fourth anniversary of his assassination have claimed the lives of at least 73 people and injured 171 others, as reported by Iranian state media.", "During the ceremony in the southeast city of Kerman, Iranian state television claimed a first and then a second explosion, claiming multiple casualties.", "\"Several petrol canisters exploded on the road leading to the cemetery and relevant authorities are monitoring the situation,\" stated the semi-official ", ".", "Ambulances were seen approaching the cemetery, where hundreds of Iranians had gathered to commemorate Soleimani's death anniversary, according to the ", " news agency.", "Soleimani was considered the most powerful figure in Iran, second only to Ayatollah Ali Khamenei, the Supreme Leader of the Islamic Republic.", "As the leader of the Quds Force, the Revolutionary Guards' wing responsible for overseas operations, he played a significant role in determining Iranian policy throughout the region.", "He was in charge of the Quds Force's clandestine activities, which included advising ally governments and armed groups like Hamas and Hezbollah and providing them with money, weapons, information, and logistical support.", "The US President at the time, Donald Trump, described Soleimani as \"the number-one terrorist anywhere in the world\" when he issued the order for the 2020 killing."]},
{"title": "Ex-MNA Mohsin Dawar survives gun attack in North Waziristan", "headline": "National Democratic Movement leader remains safe in attack due to bulletproof vehicle, police say", "time": "\nWednesday, January 03, 2024 ", "author": "Abubakar Saddiq", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525602_3771084_updates.jpg", "category": "Pakistan", "URL": "https://www.geo.tv/latest/525602-ex-mna-mohsin-dawar-survives-gun-attack-in-north-waziristan", "description": ["PESHAWAR: Former member of National Assembly and National Democratic Movement (NDM) leader Mohsin Dawar's convoy came under a gun attack by terrorists in Tappi village North Waziristan on Wednesday.", "North Waziristan District Police Officer (DPO) Rohan Zaib confirmed to ", " about the attack but noted that the politician remained safe due to the law enforcers deployed for his security. ", "He said that the security personnel accompanying Dawar fired back at the assailants, which forced them to flee from the scene. ", "According to the police, several gunshots were fired at Dawar's convoy but he remained safe because his car was bulletproof. ", "The DPO told ", " that foolproof security has been provided to the ex-MP while a search operation has been launched for the assailants. ", "\"Cowardly attacks cannot dampen our spirit. The patrons of the attackers should come in the field themselves instead of using others' children against us,\" Dawar said in reaction to the attack. ", "Commending the police and security personnel part of his convoy on swift action, the politician said that the assailants ran away after facing retaliation.", "He then vowed to continue his party's election campaign, saying that nothing can stop his political struggle.", "It may be noted that the convoy of Jamiat Ulema-e-Islam-Fazl (JUI-F) supremo Maulana Fazlur Rehman had also come under attack a few days ago in Dera Ismail Khan, a district of the Khyber Pakhtunkhwa province which is the most affected by the menace of terrorism. ", "The alleged attack — in which the JUI-F chief remained unharmed as he wasn't present there — comes in the backdrop of repeated security concerns raised by Fazl who, on multiple occasions, has cast doubts over the staging of polls due to the \"unstable\" security situation in some parts of the province.", "Pakistan has witnessed an alarming surge in terror incidents in the outgoing year, reaching the highest level since 2014.", "As per the data gathered by the Pakistan Institute for Conflict and Security Studies (PICSS), KP bore the brunt of these attacks, reporting 23 instances that resulted in 254 fatalities and 512 injuries.", "The province, along with newly merged districts (NMD), experienced 13 suicide attacks, leading to 85 deaths and 206 injuries.", "Amid the law and order situation, the Election Commission of Pakistan (ECP) has sought the help of the Pakistan Army — due to a shortfall of 270,000 police personnel — to ensure the law and order situation during the upcoming general elections."]},
{"title": "Prince Harry's been living a ‘very disastrous year'", "headline": "Experts fear Prince Harry has been living a very disastrous year", "time": "\nWednesday, January 03, 2024 ", "author": "William Blythe Haynes", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525607_3041243_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525607-prince-harrys-been-living-a-very-disastrous-year", "description": ["Experts suspect the Sussexes are probably very happy to hear that their ‘very disastrous’ year has come to an end. ", "Claims about this have been presented by royal commentator Rafe Heydel-Mankoo.", "He weighed in on things during a candid interview with ", " There, Mr Heydel-Mankoo touched on Prince Harry’s ‘disastrous’ year.", "He was also quoted saying, “I think this has been a disastrous year for the Montecito duo topping and tailing with two disastrous books, Spare as you said, which made them into a laughing stock globally that and South Park their worldwide privacy tour.”", "Not to mention, “We saw them being mocked by Family Guy in every late night talk show. And ending the year also with Endgame written by Omid Scobie.”", "“Their poll ratings took a nosedive,” as well during that time.", "So its possible that were “very happy to see an end to this year.”"]},
{"title": "King Charles' plans for monarchy in 2024 leaked", "headline": "The plans King Charles has for the monarchy in 2024 have just been leaked", "time": "\nWednesday, January 03, 2024 ", "author": "William Blythe Haynes", "feature_img": "https://www.geo.tv/assets/uploads/updates/2024-01-03/525606_7005840_updates.jpg", "category": "Entertainment", "URL": "https://www.geo.tv/latest/525606-experts-have-just-leaked-king-charles-plans-for-2024-as-well-as-his-bid-for-the-monarchy", "description": ["Experts have just leaked King Charles’ plans for 2024, as well as his bid for the monarchy.", "Insights into everything has been shared by royal commentator Rafe Heydel-Mankoo.", "He broke everything during one of his most recent interviews with GB News.", "During the course of that chat, the expert looked back at King Charles’ Coronation and said, “Last year's Christmas speech was the most watched Christmas speech of the 21st century” and “the Coronation was the most watched event of the year.”", "In the eyes of Mr Heydel-Mankoo, “The King is trying to set the tone for his reign and also reveal to the public the sort of King he's going to be. And I think he's done that very well.”", "“I think the Coronation really symbolizes his attitude towards the monarchy,” he also added.", "“It retained the service, retained all of its majesty in its dignity, but it was tweaked to make it more relevant and more reflective of the modern world around us.”", "“And I think that's really how the King views the monarchy under his reign. And of course we've seen also you know internationally he's been a huge success and proven himself to be every bit the a worthy successor to his mother,” Mr Heydel-Mankoo also chimed in to say before signing off. "]}
]